{"meta":{"title":"It's a blog","subtitle":"Mingtu's 二三事！","description":"","author":"Mingtu2019","url":"https://utgnim.github.io/sukebei","root":"/sukebei/"},"pages":[{"title":"404","text":"","path":"404/index.html","date":"02-27","excerpt":""},{"title":"关于","text":"心血来潮时，可能会写些什么！","path":"about/index.html","date":"02-27","excerpt":""},{"title":"categories","text":"","path":"categories/index.html","date":"02-27","excerpt":""},{"title":"链接","text":"这里什么也没有！","path":"links/index.html","date":"02-27","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"02-27","excerpt":""},{"title":"tags","text":"","path":"tags/index.html","date":"02-27","excerpt":""}],"posts":[{"title":"有意思的项目","text":"程序员做饭指南：https://cook.aiursoft.com/ Markdown 简历排版工具：https://resume.mdnice.com/ 文章生成器：https://suulnnka.github.io/BullshitGenerator/index.html","path":"有意思的项目/","date":"02-27","excerpt":"","tags":[{"name":"技术","slug":"技术","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"关于汽车","text":"「以下内容来源于 AI，仅供参考之用」 如果你是完全新人，但想系统地了解汽车，为未来买车打基础，我可以给你一个清晰、循序渐进的学习框架。它不会让你一下子被大量术语淹没，而是像搭积木一样，从底层逻辑到实际购车决策，逐层建立你的“汽车知识体系”。 下面我给你一个新人专用的汽车入门路线图，每一块都告诉你“为什么要懂”和“要懂到什么程度”。 一、先建立“汽车是怎么工作的”基础认知你不需要变成修车师傅，但要知道汽车的核心结构和原理，这样以后别人忽悠不了你。 你需要了解的关键模块（入门级） 动力系统（车怎么跑起来） 发动机&#x2F;电机是干嘛的 1234567891011121314151617简单来说，发动机（燃油车）和电机（电动车）都是给汽车提供动力的核心部件。你可以把它们理解为汽车的“心脏”，负责把其他形式的能量，转变成驱动车轮旋转的机械能。它们的主要区别在于：1. 发动机：燃油车的“心脏”· 能量来源：汽油或柴油。· 工作原理：通过气缸内燃烧油料，产生高温高压的燃气，推动活塞运动，最终转化为让车轮转动的力量。· 特点：技术成熟，功率大，续航加油方便。但结构复杂，噪音相对大，并会产生尾气。2. 电机：电动车的“心脏”· 能量来源：动力电池储存的电能。· 工作原理：利用电池提供的电能，在内部磁场作用下直接产生旋转运动。· 特点：响应极快，一踩就有劲；安静平顺，没有换挡顿挫；效率高且环保。但依赖充电设施。总的来说，它们的目标一致，但实现方式不同：发动机是“烧”油来产生动力，电机是用电来产生动力。 变速箱的作用（AT、CVT、DCT区别知道个大概即可） 12345678910111213141516变速箱的核心作用是改变发动机或电机输出的转速和扭矩，让汽车既有劲跑得快，又能保证发动机正常工作。你可以把它理解成一个“动力适配器”。关于AT、CVT、DCT的区别，以下是通俗版的解释：· AT（自动变速箱） 可以想象成有多个齿轮搭档，通过液力变矩器传递动力。优点是技术成熟、可靠性高、能承受大扭矩；缺点是结构复杂、成本较高、油耗相对稍高。· CVT（无级变速箱） 没有具体的齿轮，靠钢带和锥轮改变传动比。优点是极致平顺、没有换挡顿挫、非常省油；缺点是急加速时反应稍慢，无法承受过大的扭矩。· DCT（双离合变速箱） 可以理解为有两套手动挡机构在“接力”工作。优点是换挡速度极快、传动效率高、省油且运动感强；缺点是低速堵车时可能会有轻微顿挫。总结一下：· 追求皮实耐用不在乎油耗，可以选AT。· 追求极致平顺和经济省油，可以选CVT。· 追求换挡速度和驾驶运动感，可以选DCT。 驱动方式（前驱&#x2F;后驱&#x2F;四驱） 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253简单来说，驱动方式决定了是谁在推着或者拉着汽车跑。可以把车理解为：前驱是“拉”着跑，后驱是“推”着跑，四驱是“抬”着跑。以下是它们的核心区别和特点：1. 前驱（Front-Wheel Drive）这是大多数家用轿车的标配。· 特点：发动机动力直接输给前轮，前轮既负责转向又负责驱动，后轮只是从动轮。· 优点： · 成本低、效率高：结构紧凑，没有传动轴，重量轻，省油。 · 空间大：没有后驱传动轴，后排地板中间凸起小，乘坐空间更宽敞。 · 不易打滑：发动机重量压在驱动轮上，雨雪天起步比后驱稳。· 缺点： · 操控极限低：急加速时重心后移，前轮抓地力下降，容易产生“转向不足”（推头）。 · 起步劣势：大马力车起步时，重心后移，前轮容易空挠。2. 后驱（Rear-Wheel Drive）常见于豪华车、性能车和皮卡。· 特点：发动机动力输给后轮，前轮只负责转向。· 优点： · 操控更好：前后轮分工明确（前转向、后驱动），转弯半径小，容易做出更精准的动作，甚至漂移。 · 加速猛：急加速时重心后移，正好压在后轮上，抓地力更强，加速感干脆利落。 · 平顺：由于结构布局，发动机可以纵向放置，运转更平顺。· 缺点： · 空间小：底盘下有传动轴，后排中间地板通常有高高的凸起。 · 雨雪天易滑：车身重，驱动轮（后轮）附着力容易不够，导致“甩尾”。 · 成本高：结构复杂，比同级前驱车贵。3. 四驱（All-Wheel Drive / 4WD）常见于越野车、高性能车和SUV。· 特点：四个轮子都有动力。· 分类与优点： · 全时四驱：四个轮子一直都有驱动力。优点：抓地力极强，过弯稳如泰山，适合雨雪湿滑路面和高性能车。 · 分时四驱：需要驾驶员手动切换两驱/四驱模式。优点：越野能力强，硬派越野车常用。 · 适时四驱：平时是两驱，打滑时自动切换成四驱。优点：兼顾省油和通过性，城市SUV常用。· 缺点： · 费油：结构重，传动损耗大，比两驱车更耗油。 · 成本高：购车价格通常比两驱版贵不少。---一句话总结怎么选：· 如果是家用代步，想要省油、空间大：前驱足够了。· 如果追求驾驶乐趣、操控感，或者动力很强：后驱是首选。· 如果北方雨雪多，或者喜欢自驾游走烂路：四驱能给你更多信心和安全。 油车 vs 混动 vs 纯电的基本差异 12345678910111213141516171819202122232425262728293031它们最大的差异在于能量来源和驱动方式。简单来说：油车烧油，电车充电，混动是两者的结合。以下是核心区别：1. 燃油车就像现在的传统汽车，完全依靠内燃机燃烧汽油或柴油驱动。· 优点：加油方便快捷，续航能力强，技术成熟可靠，高速巡航经济性好。· 缺点：油费较高，可能面临限行限牌，机械结构复杂保养项目多，有尾气排放。2. 纯电动车由动力电池驱动电机，靠充电补充能量。· 优点：使用成本极低（电费便宜，保养简单），加速平顺安静，智能化程度高，还能享受绿牌政策。· 缺点：续航受气温和路况影响，长途充电不方便，电池成本高，目前保值率较低。3. 混合动力汽车同时拥有发动机和电机，主要分两类：· 油电混动：不需要充电，以油为主、电为辅，市区行驶极其省油，平顺感接近电车。· 插电混动：可油可电，短途用电（成本极低），长途用油（没有焦虑），能上绿牌。选购建议：· 总跑长途、追求省心选油车。· 有家充桩、主要在市区开选纯电。· 想省油又有里程焦虑，选混动。 目的：以后看车时能判断动力是否够用、是否适合你的使用场景。 底盘系统（车开起来稳不稳） 悬架类型（麦弗逊、双叉臂、多连杆） 12345678910111213141516171819202122232425262728293031323334353637悬架是连接车轮与车身的部件，它的核心作用是吸收震动，确保车轮在起伏路面能始终贴地，从而影响车的操控和舒适。这三种悬架的结构和特性各不相同。1. 麦弗逊式这是目前最主流、最常见的前悬架。· 结构：结构非常简单，主要由螺旋弹簧、减震器和下控制臂组成。你可以想象成一个减震器支柱加上一个可以活动的“膝盖”。· 优点：结构紧凑、成本低、重量轻。由于体积小，能侵占更少的发动机舱空间，所以横置前驱的买菜车特别喜欢用它。· 缺点：抗侧倾能力较弱，急转弯时车身姿态控制一般。遇到剧烈冲击时，车轮定位容易改变。· 常见于：绝大多数家用轿车的前轮（如丰田卡罗拉、本田思域、大众速腾），以及一些小型车的后轮。2. 双叉臂式可以看作是在麦弗逊的基础上，加了一根强壮的上控制臂，形成上下两个“A”字型叉臂（或称双横臂）。· 结构：上下两个叉臂像剪刀一样夹住车轮，横向刚性非常强。· 优点：抓地力极强，过弯时能更好地保持车轮垂直于地面，提供更好的操控稳定性和弯道支撑力。对于豪华车来说，也更容易调出高级的舒适感。· 缺点：成本高、空间占用大，调校难度也高。通常更贵、更大的车才有空间和预算装备它。· 常见于：豪华轿车的前悬架（如宝马5系、奔驰E级）或运动型车，以及硬派越野车（如丰田普拉多），因为它能承受更大的冲击。3. 多连杆式通常指三根或以上连杆组合而成的复杂悬架，常见于后轮。· 结构：通过多根连杆从不同角度精确控制车轮的运动轨迹。· 优点：能最大限度地保证车轮在各种路况下都垂直于地面，抓地力好，能兼顾舒适性和操控性，对路面震动的隔离感做得最好。· 缺点：结构复杂、成本高、占用空间大，而且维修保养费用相对较高。· 常见于：主流B级车及更高级别车型的后悬架（如丰田凯美瑞、大众帕萨特、雅阁等）。如今很多主打舒适的家用车后轮都用它。---总结一下：· 麦弗逊：简单实用，性价比高，市区代步首选。· 双叉臂：操控王者，追求驾驶乐趣和豪华感的好选择。· 多连杆：舒适与操控的平衡大师，主要在后轮提供高级行驶质感。 刹车系统（盘刹、鼓刹、ABS、ESP） 12345678910111213141516171819202122232425262728293031323334353637刹车系统负责减速和停车，是汽车最重要的安全配置。简单来说，可以把它理解为两套系统：一套是刹车方式（盘刹/鼓刹），属于执行机构；另一套是刹车辅助（ABS/ESP），属于电子大脑。以下是具体区别：1. 盘式刹车 vs 鼓式刹车这两者主要是物理结构上的区别。· 盘式刹车：目前最主流，像碟片一样。 · 原理：一个金属圆盘（刹车盘）夹在车轮上，刹车时用卡钳夹紧它产生摩擦力。 · 优点：散热极好、排水性好、刹车线性平稳。大力刹车时热衰减慢。 · 缺点：制造成本比鼓刹略高。 · 常见于：绝大多数轿车的前轮，以及后轮。· 鼓式刹车：老式或低配车型常用。 · 原理：形状像密封的鼓，里面有两片刹车蹄，刹车时向外顶住鼓的内壁制动。 · 优点：成本低、摩擦力巨大、寿命长，且密封性好。 · 缺点：散热差，连续刹车容易热衰减导致刹车变软。而且结构不封闭，涉水后会有短时刹车减弱。 · 常见于：低端车的后轮或部分货车，利用其大摩擦力且便宜的优点。2. ABS vs ESP这两者都是电子辅助系统。· ABS（防抱死制动系统）： · 作用：紧急刹车时防止车轮抱死。如果没有ABS，一脚急刹车轮锁死就会失去转向能力，车会滑出去。ABS会每秒点刹几十次，让你能在刹车的同时打方向避障。· ESP（电子稳定程序）： · 作用：相当于车身稳定控制系统，是ABS的进阶版。当检测到车辆转向不足（推头）或转向过度（甩尾）时，ESP会单独对某个车轮刹车，并干预动力输出，把车身“拽”回来，防止失控侧滑。---总结：· 盘刹：日常家用首选，散热好，看得见，踏实。· 鼓刹：成本导向的选择，但低速代步够用，保养得当即可。· ABS：紧急情况下能让你刹得住还能躲得开。· ESP：关键时刻能救命的系统，纠正车身姿态防止甩尾。买车时建议优先选择标配ESP的车型。 车身结构（承载式 vs 非承载式） 12345678910111213141516171819202122232425262728车身结构简单来说，就是汽车“骨架”的形态。它决定了这辆车是适合越野还是适合公路。这两种结构的核心区别在于：车身是否承担整车重量，还是像背包一样背在底盘上。1. 非承载式车身带大梁的硬派结构，可以想象成“底盘（大梁）+ 车壳”。· 结构特点：有一根独立的刚性车架（俗称大梁），发动机、悬挂都装在这根大梁上，再把车壳扣在上面。· 优点：车身强度极高、抗扭曲力强。即使三个轮子悬空，车身也不会变形。越野时大梁能吸收冲击，舒适性反而可以做得不错。· 缺点：非常笨重、重心高、油耗大。而且由于车壳和底盘是分开的，操控性差，过弯像开船，车内空间也受影响。· 常见于：硬派越野车（如奔驰G级、牧马人、丰田普拉多、坦克300、各种皮卡）。2. 承载式车身没有大梁的一体式结构，可以想象成“像鸡蛋壳”。· 结构特点：没有独立的大梁，整个车身是一个整体结构。悬挂直接连接在车身上，整个车身承受所有重量。· 优点：重量轻、重心低、空间利用率高。公路操控性好，过弯侧倾小，油耗也更低。目前轿车和城市SUV几乎都采用这种结构。· 缺点：抗扭曲强度不如非承载式，不适合高强度越野。如果强行冲坡，车身受力变形可能导致车门关不上。---总结一下：· 非承载式：有大梁，硬派越野或载重专用，结实抗造，但公路性能一般。· 承载式：没大梁，家用代步主流，舒适省油操控好，但不适合重度越野。 目的：知道哪些配置影响安全、操控和舒适，不会被“花里胡哨的配置”迷惑。 车内电子与辅助驾驶 L2辅助驾驶是什么 123456789101112131415161718192021222324252627282930313233L2辅助驾驶指的是部分自动驾驶，它的核心定义是：车自己控制加速、刹车和转向，但驾驶员必须时刻盯着路况，随时准备接管。它是目前主流新车最常见的配置，也是辅助驾驶的一个分水岭。1. L2的具体定义在汽车工程师学会（SAE）的标准中，L2属于“组合功能辅助”。· 车做什么：系统同时接管了横向控制（方向盘）和纵向控制（油门、刹车）。这意味着车辆可以自己保持在车道内行驶，并和前车保持安全距离。· 人做什么：驾驶员必须持续监视路况，观察环境，手和脚虽然可以短暂离开，但眼睛和注意力一秒都不能离开路面。如果出现系统处理不了的情况（如修路、加塞），驾驶员必须立刻接管。2. 通俗理解：优秀的“辅助驾驶”，而非“自动驾驶”可以把L2想象成一个正在学车的学员，手脚很麻利，但判断力有限：· 在封闭的高速或标线清晰的高架路上，它开得很稳，能有效减轻驾驶疲劳。· 但遇到复杂的路口、修路的桩桶、突然横穿的车辆行人，它可能就不会处理了。· 这时候教练（也就是你）必须时刻盯着，随时准备抢方向盘或踩刹车。3. L2通常包含哪些功能？要达到L2级别，通常需要以下两个核心功能同时工作：1. 自适应巡航（ACC，Adaptive Cruise Control）：设定好速度，车会自动跟着前车加速、减速，直至刹停。2. 车道居中保持（LKA，Lane Keeping Assist）：车会自动识别车道线，并主动调整方向盘，让车一直保持在车道中间行驶。请注意： 如果只有能纠正车道的车道保持，或者只有定速巡航，那只能算L1或L0级别。4. L2与更高级别的区别· L2：人负责开车，车负责帮忙。出事算人的。· L3及以上：车负责开车，人变成乘客（虽然L3要求人在特定条件下仍需接管）。一旦开启，出事算车的（或车企的）。 ACC、AEB、车道保持这些功能的作用 123456789101112131415161718192021222324252627282930313233343536这三个功能是L2级辅助驾驶的核心基石，但各自的分工完全不同。如果把开车比作骑马，它们分别扮演了不同的角色。1. ACC——自适应巡航控制角色：替你踩油门和刹车的“长途马夫”· 作用：传统定速巡航只能固定速度，而ACC会在前方没车时，加速到你设定的速度巡航；一旦检测到前面有车，它会自动减速，与前车保持你设定的安全距离。前车变道走了，它又会自动加速到设定速度。· 价值：主要解放双脚。跑高速或堵车时，不用频繁在油门和刹车之间切换，只需扶着方向盘就行。2. 车道保持系统角色：帮你扶方向盘的“纠偏员”· 作用：通过摄像头识别车道线。如果车辆不知不觉偏离车道，它会主动轻微修正方向盘，把车拉回车道中间。· 分类：通常分为两种： · 车道偏离预警：只会发出警报提醒，不帮你修方向。 · 车道居中保持：这是L2的核心功能，持续让车保持在车道正中间行驶。· 价值：主要解放双手（但手仍需轻扶方向盘），防止因走神或困倦导致车辆跨线。3. AEB——自动紧急制动角色：关键时刻帮你踩刹车的“安全保镖”· 作用：利用雷达/摄像头持续监测前方路况。当系统判断碰撞无法避免且你没踩刹车（或刹车力度不足）时，它会自动全力刹车，以避免或减轻碰撞。· 价值：这是最重要的主动安全配置，通常在时速60公里以下的城市路段效果明显，能有效防止追尾或鬼探头事故。---总结一下：· ACC让你不用自己踩油门。· 车道保持让你不用自己扶方向。· AEB在你反应不过来时救命。需要注意：ACC + 车道居中保持 = L2级辅助驾驶（部分解放手脚）；而AEB则是独立的保底安全配置，即便不开ACC，它也在后台随时待命。 车机系统（CarPlay、安卓车机、语音助手） 1234567891011121314151617181920212223242526272829303132333435363738车机系统可以理解为汽车的“智能大脑”，它负责控制你眼睛看到的（屏幕）、手摸到的（交互）以及嘴说出的（语音）体验。CarPlay、安卓车机和语音助手，正好是三个不同维度的核心角色。1. CarPlay角色：把iPhone“投射”到车上的“无缝桥梁”· 作用：它不是一套完整的车机系统，而是手机和车机的互联协议。插上数据线或无线连接后，车机屏幕就会变成iPhone的简化界面。· 优点：体验极佳。如果你用iPhone，上手零成本。地图、音乐、信息等App都遵循苹果的设计规范，流畅且简洁。Siri的存在也让语音交互更自然。很多用户买车甚至会把“是否支持CarPlay”作为必选项。· 缺点：对安卓用户不友好，且无法控制车辆核心功能（如空调、车窗）。2. 安卓车机角色：让车变成“大号安卓平板”的“原生大脑”· 作用：指车机底层系统基于安卓开发（目前绝大多数新车都是安卓底层）。它自带SIM卡或连接Wi-Fi，可以独立安装App、在线更新地图、看视频、联网。· 优点：生态丰富、功能集成度高。它能深度控制车辆，例如在屏幕上调节驾驶模式、氛围灯，甚至看B站、刷抖音。· 缺点：学习成本比CarPlay略高；用久了可能会有安卓设备常见的卡顿问题；部分品牌会在系统中植入开机广告或付费订阅服务。3. 语音助手角色：车内功能的“免提遥控器”· 作用：通过语音指令控制车辆。这是目前智能化体验的分水岭。· 能力分级： · 基础版：只能听懂“打开导航”、“调大音量”这类固定指令。 · 高阶版：能听懂“我有点冷”（自动调高空调温度）、“附近哪家川菜馆评分高”（自动搜索并导航），甚至支持连续对话（一次唤醒后连续下达多条指令）和可见即可说（屏幕上显示的字，念出来就能点）。· 价值：解放双眼和双手。开车时想调温度或换目的地，不用再盯着屏幕点按，直接动嘴就行，既方便又安全。---总结一下：· CarPlay：如果你是苹果用户，它是最好的手机投射方案，专注做好导航和音乐，简洁无广告。· 安卓车机：它是车的原生智能大脑，功能最全面，能控制车辆底层，但体验取决于车企的优化能力。· 语音助手：它是交互方式的变革，高阶的语音能让车更懂你。简单来说，理想的车机体验通常是：一个好的安卓车机（提供基础能力）+ 无缝支持的CarPlay（提供手机生态）+ 聪明的语音助手（提供免提控制）。 目的：判断哪些功能是真实提升体验，哪些只是噱头。 二、建立“看懂参数配置表”的能力以后你看懂一张配置表，就能判断一辆车值不值。 你要重点关注的参数 动力相关 马力、扭矩、百公里加速 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647这三个参数是衡量汽车动力性能最核心的指标，它们相互关联，但描述的并不是同一件事。可以用一个通俗的比喻来理解：把发动机想象成一个人在骑马。1. 扭矩角色：一脚油门踩下去，推着你走的那股“爆发力”· 物理定义：发动机输出轴旋转时产生的扭转力矩，单位是牛米。· 通俗理解：可以想象成这个人力气有多大。力气越大，一斧子劈下去就越狠。· 驾驶感受：扭矩决定了车加速时的推背感和爬坡、拖拽能力。 · 扭矩大的车，起步或急加速时感觉更生猛，轻踩油门就有劲。 · 柴油机和电动车通常扭矩很大，所以开起来会觉得特别有劲。· 注意：扭矩有最大扭矩转速区间。比如1700-4000转，意思是发动机在这个转速区间内能发出最大的力。2. 马力角色：这辆车最高能跑多快的“耐力”· 物理定义：发动机单位时间内做功的多少，单位是匹或千瓦。马力 = 扭矩 × 转速。· 通俗理解：可以想象成这个人能持续输出多大的功率。力气大（扭矩大）但体力差，持续不了多久；马力大意味着既有力气，又能长时间高速奔跑。· 驾驶感受：马力决定了车的极速和高速再加速能力。 · 马力大的车，在高速上从100km/h加速到150km/h会非常从容。 · 极速看马力，加速看扭矩？ 不完全对，更准确的说法是：决定一辆车能跑多快（极速）的是马力；决定它加速快不快（达到这个极速的时间）的，是马力曲线和车重。 但日常感受中，起步和低速推背感主要靠扭矩。3. 百公里加速角色：纸上谈兵结束，直接拉出来比一场的“实战成绩”· 定义：车辆从静止状态加速到时速100公里所需要的最短时间，单位是秒。· 通俗理解：这就是最终比赛结果。它综合了马力、扭矩、车重、轮胎抓地力、变速箱效率以及是否四驱等所有因素。· 驾驶感受：这是最能直观体现一辆车“快不快”的数据。 · 7秒破百，会感觉这是一辆性能不错的车。 · 4秒破百，这是超跑级别的感受，会产生眩晕感。---总结一下：· 扭矩：这人力气大不大。力气大，起步、爬坡就猛。· 马力：这人综合能力强不强。综合强，极速和高速就快。· 百公里加速：这人去跑100米短跑用了多少秒。这是最终的考试成绩。日常选车参考：· 市区代步：重点关注扭矩（低速有劲更轻松）。· 高速多：重点关注马力（高速超车有底气）。· 追求刺激：直接看百公里加速（这是最终成绩单）。 电车要看电机功率、电池容量、续航标准（CLTC&#x2F;WLTC） 12345678910111213141516171819202122232425262728你说得对，电车的“三大件”确实得看这仨。它们和燃油车的参数对应关系如下：1. 电机功率：电车的“马力”· 是什么：类似发动机的马力，决定了车能跑多快以及后段加速能力。· 区别：电车电机起步即峰值扭矩，所以哪怕功率看似不高，红绿灯起步也往往比油车快。· 看车建议：市区代步（单电机、150kW左右足够）；追求性能（双电机、300kW以上，零百加速能进4秒级）。2. 电池容量：电车的“油箱”· 是什么：单位是度（kWh），类似燃油车油箱的升数，直接决定续航上限。· 误区：电池大≠跑得远，还要看电耗（就像油箱大不一定省油）。· 看车建议： · 混动/增程：纯电续航选CLTC标准下150km以上的，才能满足日常通勤只用电。 · 纯电：60-70度（主流，市区够用）；80-100度（踏实，适合长途）。3. 续航标准：电车的“工信部油耗”看电车续航，不能只看数字，一定要看是按什么标准测出来的：· CLTC（中国标准）：更侧重于低速、怠速工况，测出来的数值最虚、最乐观（看着爽，但冬天高速打对折是常事）。· WLTC（国际标准）：工况更接近真实驾驶，急加速、高速路段占比多，数值更扎实、更接近实际。· EPA（美国标准）：极其严格，数值最真实（但国内极少标注）。看车建议： 建议直接以WLTC标准作为参考依据来估算实际能跑多远。总结：想判断一辆电车行不行，可以关注“百公里电耗”——这最能反映三电系统的效率。 安全相关（最重要） 主动安全：AEB、ESP、车道保持 1234567891011121314151617181920212223242526272829303132333435363738394041这三个配置组成了现代汽车主动安全的黄金三角。简单来说，它们的核心区别在于：AEB是替你踩刹车，ESP是帮你稳车身，车道保持是帮你扶方向。以下是各功能的详细解析：1. AEB：自动紧急制动角色：最后一道防线的&quot;老司机&quot;· 作用：通过雷达/摄像头监测前方路况。当系统判定即将追尾且你没反应时，会自动全力刹车。· 价值：主要在低速市区（60km/h以下）有效，能大幅减少&quot;鬼探头&quot;和追尾事故。它属于保底配置，默认开启，不建议关闭。· 注意：各家性能差异大。好的AEB能避免碰撞，差的可能误触发或完全没反应。2. ESP：车身电子稳定系统角色：纠正失控的&quot;平衡大师&quot;· 作用：实时监测车轮转速和车身姿态。当发现车辆转向不足（推头）或转向过度（甩尾）时，ESP会单独给某个车轮刹车并调整动力，把车身拉回正轨。· 价值：湿滑路面、高速紧急变道时，它是救命的配置。比如猛打方向避让障碍物时，它能防止车辆转圈或侧滑。· 注意：ESP无法完全关闭（部分运动模式可部分关闭），这是法规强制要求。3. 车道保持角色：防止跑偏的&quot;纠偏员&quot;· 作用：用摄像头识别车道线。分两种： · 车道偏离预警：压线了只滴滴报警，不干预方向盘。 · 车道居中保持：持续主动修方向，把车控制在车道正中间（这是L2辅助驾驶的核心功能）。· 价值：高速或长途驾驶时能极大缓解疲劳，防止因走神偏离车道。· 注意：它依赖清晰的车道线，暴雨或磨损严重的路面可能失效。---总结一下它们的关系：· AEB：负责纵向避险，防止前后追尾。· ESP：负责横向稳定，防止侧滑甩尾。· 车道保持：负责横向辅助，防止无意偏离。一句话选车建议：这三个都属于关键时刻能保命的配置，买车时建议尽量选配齐全的版本。 被动安全：气囊数量、车身结构、碰撞测试成绩 1234567891011121314151617181920212223242526272829303132333435363738394041被动安全可以理解为车辆在碰撞不可避免时，最后一道保护乘员的防线。它与主动安全的区别在于：主动安全是帮助避免事故，被动安全是保护事故中的生存空间。气囊数量、车身结构、碰撞测试成绩是衡量被动安全最核心的三个维度。1. 气囊数量角色：碰撞瞬间的&quot;充气沙发&quot;· 作用：防止乘员撞击硬物（方向盘、仪表台、玻璃），并分散冲击力，减少伤害。· 关键点： · 数量很重要：常见配置是6气囊（主/副驾、前排侧气囊、侧气帘）。部分减配车型只有2气囊（仅主副驾），侧碰保护不足。建议选6气囊或以上。 · 侧气帘容易被忽视：它保护头部，防止侧面碰撞或翻滚时撞到B柱或玻璃。 · 远端气囊：部分新车在主副驾之间增加中央气囊，防止碰撞时两人头部互撞。2. 车身结构角色：保护乘员的&quot;安全笼&quot;· 设计理念：该硬的地方硬，该软的地方软。 · 乘员舱（硬）：A柱、B柱、C柱和底盘纵梁必须用高强度钢/热成型钢打造，确保碰撞后不变形，保证生存空间。 · 溃缩区（软）：车头和车尾设计成吸能区，碰撞时像纸箱一样溃缩，吸收撞击能量，防止冲击传递到驾驶舱。· 看车建议：留意高强度钢占比和A/B柱的钢材强度。3. 碰撞测试成绩角色：应试教育的&quot;分数单&quot;· 作用：由第三方机构模拟撞车打分，是衡量安全的直观标准。· 主要机构： · 中保研（CIASI）：国内参考价值高，标准严，看车内成员安全指数是否为G（优秀）。 · C-NCAP：中国新车评价规程，五星车型多，需关注具体得分率。· 看车建议：直接看25%偏置碰撞（小重叠面碰撞）成绩。这是难度最高的项目，考验A柱强度。---总结：买车时怎么选？1. 先看分数：查中保研碰撞测试成绩，车内乘员安全指数是否为G。2. 再看结构：关注高强度钢占比和A柱强度。3. 最后数气囊：确保全车满足6气囊，看侧气帘是否覆盖前后排。 舒适性配置 座椅（材质、加热、通风） 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647汽车座椅直接决定了你每天开车屁股底下舒不舒服，以及长途驾驶会不会腰酸背痛。它主要涉及三个维度：材质（触感）、加热（冬季友好）和通风（夏季友好）。1. 座椅材质角色：身体的&quot;贴身衣物&quot;· 织物（布座椅） · 优点：冬暖夏凉（夏天不烫腚，冬天不冰腚），摩擦力大（过弯不滑来滑去）。 · 缺点：显廉价（看起来档次不高），打理麻烦（牛奶咖啡洒了容易渗进去，难清洗）。 · 常见于：低配入门车型。· 仿皮（PU革/PVC） · 优点：看起来像皮，有档次，好打理（湿抹布一擦就干净）。 · 缺点：透气性差（夏天烫后背，冬天冰屁股），很多廉价仿皮用几年会开裂掉皮。 · 常见于：绝大多数主流家用车（因为成本适中）。· 真皮（Nappa/Demi等） · 优点：质感细腻、透气性好（比仿皮强），冬暖夏凉表现更好。 · 缺点：贵（通常高配才有），娇贵（需要保养，怕尖锐物划伤）。 · 常见于：豪华品牌或国产高端车型。· Alcantara（翻毛皮） · 优点：摩擦力极强（激烈驾驶时把人牢牢粘在座位上），冬暖夏凉，显运动。 · 缺点：难打理（手上有汗摸上去会留下印子），贵。 · 常见于：性能车、运动型车。2. 座椅加热角色：冬天的&quot;电热毯&quot;· 作用：通过座椅内部的电热丝发热，让屁股和后背暖和起来。· 体验：冬天（尤其是北方）非常实用的功能。通常开启几分钟就能热起来，配合远程启动使用效果更好，上车就是暖和的。· 注意：通常只出现在仿皮/真皮座椅上（因为织物座椅不需要加热也不冰）。3. 座椅通风角色：夏天的&quot;屁股风扇&quot;· 作用：通过座椅内部的吸风/吹风装置，带走臀部和背部的汗湿，保持干爽。· 体验：这是比加热更高级的享受。夏天开车，如果没有通风，即使空调开得很冷，后背和裤子也容易捂出汗粘在身上。有了通风，那种干爽感非常解暑。· 注意：成本较高，通常出现在高配车型上。---总结一下：· 南方用户：重点关注座椅通风（夏天救命），材质可优先考虑真皮或高质仿皮+打孔（利于通风效果）。· 北方用户：重点关注座椅加热（冬天舒服），最好方向盘加热也配上。· 预算有限：织物座椅其实很实用，或者选仿皮版本自己加个通风坐垫。 空调（双区、后排出风口） 1234567891011121314151617181920212223242526272829汽车空调直接影响你每天开车的幸福感。它不仅是制冷/制热，还决定了车内每个人能不能都舒服。1. 双区空调角色：主副驾的&quot;气温仲裁者&quot;· 定义：允许驾驶位和副驾驶位独立设定温度。· 价值：解决&quot;你冷她热&quot;的矛盾。比如你怕热想开22度，副驾驶怕冷想开26度，双区空调能满足。· 原理：在空调箱内部增加风门和独立的温度调节机构，左右出风口可以吹出不同温度的风。· 注意：这只是温度分区，压缩机是共用的，所以设定温差太大会影响制冷/制热效率。2. 后排出风口角色：后排乘客的&quot;呼吸权&quot;· 位置：通常在前排中央扶手后方或B柱（前排座椅旁边）。· 价值：夏天救命。没有后排出风口的车，前排冻成狗，后排还在流汗，因为冷空气难以后移。有了它，全车降温更快更均匀。· 进阶：部分高端车是后排独立空调（带温度/风量控制），但多数是只有出风口。---总结一下：· 双区空调：解决前排两个人的温差问题，属于舒适性升级。· 后排出风口：解决全车人的温差问题，属于实用性刚需。选购建议：如果是家用车，后排出风口建议作为必选项，对家人尤其是后排的老人小孩友好。双区空调则是锦上添花，能让主副驾相处更和谐。 隔音、悬架类型 123456789101112131415161718192021222324252627282930313233343536隔音和悬架类型共同决定了车辆的行驶品质，也就是你开车时的高级感、安稳感和舒适感。可以把它们理解为：悬架是车轮和车身之间的“弹簧缓冲垫”，负责物理上的滤震；隔音是车厢和外界之间的“隔音棉”，负责听觉上的隔绝。1. 隔音（NVH）角色：车厢的“静谧守护者”隔音在汽车工程里属于NVH（Noise噪音、Vibration振动、Harshness声振粗糙度）领域。噪音主要来自三个方面：· 风噪：速度起来后，A柱、后视镜、车门缝隙的空气摩擦声。流线型设计、双层夹胶玻璃能有效降低它。· 胎噪：轮胎碾压路面产生的噪音，粗糙路面更明显。静音轮胎和轮拱内衬的吸音材料是关键。· 发动机/电机噪音：油车加速时的引擎声，电车高速时的电流声。防火墙隔音棉等能起到隔绝作用。看车建议：判断隔音好坏，建议关闭音乐，在不同路面（粗糙柏油路、水泥路）进行实测。留意A柱风噪和底盘胎噪。2. 悬架类型角色：车轮的“运动控制师”不同的悬架结构，决定了车是舒适取向还是运动取向。· 麦弗逊：结构简单，成本低，占用空间小，是绝大多数家用车前悬架的首选。优点是家用足够，缺点是侧向支撑一般。· 双叉臂：横向刚度大，过弯时车轮能更好贴合地面，抓地力强。常见于豪华车或运动型车，操控性好。· 多连杆：舒适与操控兼顾得比较好，能提供更细腻的滤震和车轮定位。是主流B级车后悬架的标配，也是衡量底盘是否厚道的标志之一。---总结：两者如何共同影响高级感？· 物理感受：底盘质感主要由悬架决定。压过减速带是“咚咚”两声闷响，还是“哐当”松散的感觉，取决于悬架调校。· 听觉感受：高速巡航是否从容，主要由隔音决定。车内能否正常交谈、听音乐，取决于隔音用料。一句话选车建议：想追求舒适高级感，可以关注：① 悬架结构（最好是前麦弗逊/双叉臂 + 后多连杆）；② 隔音配置（双层夹胶玻璃、米其林/马牌静音轮胎）。 使用成本 油耗&#x2F;电耗 12345678910111213141516171819202122232425262728293031323334353637383940油耗和电耗，就是车子的&quot;饭量&quot;。它直接决定了你以后开车要花多少钱。虽然都是衡量能源消耗的指标，但两者的计算逻辑和影响因素有挺大区别。1. 燃油车：油耗单位：升/百公里（L/100km）简单说，就是车每跑100公里需要烧掉多少升汽油。· 怎么看工信部油耗？ 厂家标的通常比较理想，实际很难开到。可以直接看车主众测油耗，或者按&quot;车重系数法&quot;毛估：1.5吨左右的家用车，市区油耗通常在8-10L属于正常。· 关键变量：路况 油车最怕堵车。频繁起步停车，发动机怠速不走路光烧油，油耗会飙升。所以纯油车市区油耗通常比高速高。2. 纯电车：电耗单位：度/百公里（kWh/100km）指车每跑100公里需要消耗多少度电。· 核心逻辑：一度电跑多远 电车恰恰相反，高速比市区费电。因为电车没有怠速概念，停着基本不耗电；但速度一快（超过100km/h），风阻大幅增加，电耗就上去了。· 怎么看电耗？ 可以看电池度数和官方续航倒推。例如：60度电池 ÷ 标称续航500km = 0.12度/km = 12度/百公里。如果实测能维持在15度/百公里以内，就算省电的了。· 注意：隐性杀手 冬季低温是电耗的大敌。磷酸铁锂电池更怕冷。开暖风一小时能额外消耗1-3度电，这也是电车冬天续航打折扣的主要原因。---总结：怎么对比使用成本？可以粗略按 &quot;百公里花费&quot; 来算笔账：· 油车：油耗8L/100km × 油价8元/L ≈ 64元/100km。· 混动：油耗4-5L/100km ≈ 32-40元/100km。· 电车：家充桩（0.5元/度） × 15度 ≈ 7.5元/100km；如果用外面的快充桩（1.5元/度），大概是22.5元/100km。所以，如果主要在城市代步、家里能装充电桩，电车使用成本优势非常明显；经常跑高速长途，油车和混动会更省心。 保养周期与费用 123456789101112131415161718192021222324252627282930313233343536373839汽车的保养周期与费用，直接关系到你将来养车的花费和去修理厂的频率。简单来说，结构越复杂、技术越古老的动力形式，保养项目越多，花费也相对较高。下面是关于油车、混动和电车在这方面的核心差异。1. 燃油车：项目多，频率高燃油车的保养核心是换血——发动机的各种油液。· 小保养：通常每 5000到10000公里 进行一次。主要是更换机油、机滤，并对车辆做基础检查。费用因机油好坏而异，自然吸气的车可能只需300-500元，涡轮增压或需要加全合成机油的车型通常在600-1000元。· 大保养：每隔 2年到4万公里 左右进行一次。在小保养的基础上，还需要更换空气滤芯、空调滤芯、汽油滤芯、火花塞、刹车油等项目。单次费用通常在 1500到3000元 起步。· 变速箱油：自动变速箱换油比较贵，且周期较长，通常在 6万到8万公里，费用可能在 800到2000元 之间。2. 纯电动车：极简主义，主要是检查电车没有发动机，所以彻底告别了机油、机滤、火花塞这些东西。· 常规保养：通常每 1万到2万公里 或一年进行一次。内容以检查为主，比如检查三电系统（电机、电池、电控）的工况、底盘、轮胎、刹车片、更换空调滤芯等。· 费用：因为没有换机油这个项目，单次常规保养通常只需要 100到300元 左右的基础工时费和材料费（主要是空调滤芯）。· 特殊项目：电车有减速器油（齿轮油），更换周期很长，通常在 4万到6万公里 以上。刹车油也需要按规定更换。另外，防冻液虽然需要更换，但周期比油车发动机的冷却液长，主要用来给电池和电机温控。3. 混合动力车：兼顾两者，看工况混动车的保养规则介于油车和电车之间，具体看是哪种混动。· 油电混动（不能充电）：发动机仍然会频繁启停工作，所以保养周期和项目基本向燃油车看齐，需要按时更换机油机滤。但由于发动机工况通常优化得较好（主要在高效区间运转），有些品牌的保养周期可能比纯油版更长。· 插电混动（能充电）：保养逻辑取决于你怎么开。 · 如果你每天充电，当电车开：发动机很少启动，那么按时间更换机油机滤的必要性依然存在（机油会乳化变质），但里程可以适当延长。费用会低于同级油车，但高于纯电车。 · 如果你不充电，当油车开：那么它就是一台背着电池的油车，保养费用和油车基本持平。总结：养车成本排序从保养费用角度看，通常是：纯电动车 &lt; 插电混动（充电多） &lt; 油电混动/插电混动（不充电） ≈ 燃油车· 油车：需要做好长期投入的心理准备，保养项目多。· 电车：确实省钱省心，但要注意大保项目（如换油换水）和轮胎磨损（因为车重且加速快）。· 混动：既有发动机又有电机，理论上保养项目一样不少，但周期可以适当放宽。 保险费用 123456789101112131415161718192021222324252627282930313233汽车保险的费用不像保养那么“固定”，它更像一个根据你的车和人实时变动的“动态数字”。核心规律是：电车普遍比油车贵，出险次数直接影响保费涨跌。下面是关于油车和电车在保险费用上的核心差异。1. 保费定价逻辑：从“看车价”到“看风险”以前大家觉得车价越贵保费越高，但现在不完全是这样了。保险公司更看重这辆车出事故的概率（出险率）和修起来贵不贵（零整比）。· 油车（成熟稳定）：由于油车拥有海量的历史数据，保险公司的定价模型非常成熟。只要你连续不出险，保费通常会逐年稳稳下降。比如一辆开了几年的家用RAV4，在没出险的情况下，保费可以一路从2000多降到1000以内。· 电车（动态波动）：电车的保险价格波动较大。虽然车价每年在降，但因为整个行业的赔付率较高（据统计2024年行业曾亏损57亿），加上电池包维修成本高，保险公司对电车的定价普遍更谨慎。这就导致了即使你没出险，如果保险公司发现你这批车型整体事故率偏高，续保时保费也可能不降反升。2. 保费价格参考为了让你有个直观印象，这里有一个大概的首年保费范围（包含交强险、车损险、200万三者险）：· 主流油车：10-20万的家用车，首年全险通常在 4000-5500元 左右。如果不出险，第二年能降到3000多，第三年可能就2000多了。· 经济型电车：10-20万级别（如比亚迪秦），首年保费大约 5000-6500元。· 主流/高端电车：20-40万级别（如特斯拉Model 3/问界M7），首年保费通常在 7000-9000元 之间。如果是50万以上的高端电车，首年保费甚至可能超过 1.8万元。3. 影响保费的关键变量除了车型，还有几个因素直接决定了你第二年及以后的保费：1. 出险次数（最重要的因素）：只要出险一次，次年的折扣就没了；出险两次及以上，保费甚至可能翻倍。所以老司机常说，小刮蹭（几百块能修好）尽量自费，别报保险，因为明年涨的保费可能远不止这个数。2. 违章记录：现在的保险系统很多已经和交管数据打通。如果经常违章，保费也可能上浮。3. 地区差异：一线城市、交通事故高发地区或极端天气频发地区，保费也会比小城市贵一些。4. 省钱小贴士· 拒绝捆绑：买车时4S店捆绑的保险通常较贵，提车后可以自己找保险公司比价。· 保额要够：三者险建议直接上300万，如今人伤赔偿标准高，多花一两百块能买个踏实。· 善用折扣：连续不出险、驾驶习惯好，可以享受“无赔款优待”折扣，最低能到4折左右。 目的：你能快速判断“这车贵在哪里、便宜在哪里”。 三、建立“买车时要考虑什么”的框架新人最容易被广告、KOL、销售带偏，所以你要有自己的判断体系。 你要提前想清楚的 5 个问题 你的主要用途是什么 上下班代步 家用 长途旅行 城市通勤 你的预算范围 裸车预算 上路预算 后期养车预算 你所在城市的环境 是否限牌 是否限行 是否有充电条件（决定油车还是电车） 你对品牌的偏好 合资 vs 自主 新能源 vs 传统燃油 你对驾驶体验的要求 动力强不强 舒适还是运动 科技感还是稳定耐用 目的：让你买车时不会被“别人说好”影响，而是基于自己的需求做选择。 四、建立“试驾和选车”的实战能力新人试驾时往往不知道要看什么，我给你一个简单 checklist。 试驾时重点关注 起步是否平顺 刹车是否线性 低速是否顿挫 过减速带是否硬 车内噪音（风噪&#x2F;胎噪&#x2F;发动机噪音） 车机是否卡顿 座椅是否舒服 目的：让你试驾时不再“感觉不错”，而是能判断优缺点。 五、建立“购车流程”的清晰认知新人最怕被坑，所以流程要清楚。 你要了解的流程 选车 → 试驾 → 砍价 → 下订 → 等车 → 上牌 → 保险 → 提车检查 哪些费用是必须的，哪些是可以拒绝的 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748买一辆车，落地价格确实比指导价高出一截，但并不是每一项收费都是合理或必须交的。把这些费用拆解清楚，能帮你守住钱包。一、这些费用是必须交的（硬性支出）这部分钱是无论如何也躲不开的，要么交给国家，要么是购车的基础支出。1. 裸车价款：这是购车发票上的金额，也是车辆本身的价值。需要注意的是，最终成交价往往低于指导价（热门车除外），可以谈。2. 车辆购置税：交给国家的税。 · 油车/混动：通常为扣除增值税后的车价 × 10%。大约相当于裸车价的8.5%左右。买一辆20万的油车，购置税大约在1.7万左右。 · 纯电车：目前免征购置税（政策延续到2025年底，后续是减半）。这是电车的一大优势。3. 交强险：国家强制要求购买的责任险。不买不让上路。家用6座以下小车，首年950元。这个费用是固定的，保单必须出具。4. 车船使用税：地税部门征收的税费。只要拥有车辆，每年都要交。金额根据排量变化，1.6L以下的家用车每年大约300-360元。通常和交强险一起缴纳。二、这些费用可以拒绝（弹性支出/智商税）这部分是4S店主要的利润来源，也是消费者容易踩坑的地方。大多数都可以拒绝或自己办。1. 上牌服务费/代办费 · 4S店报价：动辄2000-5000元。 · 实际情况：自己去车管所上牌，成本大约120-300元（含牌照工本费、行驶证费）。如果嫌麻烦让4S店代办，给500元辛苦费已经算比较高了，再高就是在薅羊毛。2. 金融服务费/手续费 · 背景：贷款买车时容易出现。 · 实际情况：正规银行或厂家金融通常不收额外手续费。如果4S店说要收几千块的贷款手续费，这部分属于不合理收费。你可以直接拒绝，或者要求他们通过车价优惠来抵扣掉。现在竞争激烈，很多品牌直接是免息免手续费。3. PDI检测费/出库费/物流费 · 4S店说辞：车辆交付前的检测费、仓库保管费、运输费。 · 实际情况：PDI检测是经销商的义务，相当于卖出一个商品前必须确保它是合格的。这部分成本应该由经销商承担，转嫁给消费者是不合理的。这个费用可以直接拒交。4. 续保押金 · 情况：贷款买车时，销售可能会要求交押金，承诺未来几年都在店里买保险。 · 实际情况：建议尽量不要同意。因为4S店保险通常比外面自己找渠道贵不少。如果被强制要求，可以谈或者换一家店。即便交了，第二年也要记得回来要钱。5. 加装潢/精品费 · 4S店说辞：强制要求购买贴膜、脚垫、记录仪套餐，动辄大几千。 · 实际情况：4S店送的脚垫、贴膜往往质量一般。如果是热门车供不应求，确实可能被迫加装，但可以尽量谈。如果是冷门车，完全可以拒绝，自己去汽配城或网上买，能省一半钱。---总结：落地价应该怎么算？合理落地价 ≈ 裸车成交价 + 购置税 + 交强险 + 车船税 + 自己上牌费（约200元）可以拒绝的（不用给）：上牌服务费（超过500就是坑） + 金融手续费 + PDI检测费 + 续保押金 + 强制装潢。举个例子：买一辆20万的油车，合理落地大约需要：20万（裸车）+ 1.7万（购置税）+ 0.1万（交强险）+ 0.04万（车船税）+ 0.02万（自己上牌）≈ 21.86万。如果4S店给你算到22.5万以上，中间多出来的五六千块，很可能就是你为上面那些“可拒绝”的费用在买单。 如何验车（外观、轮胎、玻璃、车身缝隙、公里数） 123456789101112131415161718192021222324252627282930313233343536373839404142434445验车是提车时最关键的一步，主要是为了排除运损车、库存车或瑕疵车。按照你列出的这几个项目，可以按从外到内、从远到近的顺序来检查：1. 看外观（漆面）这一步最好把车开到光线好的地方，或者洗车后检查。· 绕车一周：蹲下来，以45度角看车身曲面，检查有无色差（补过漆的车在光线下会有明显深浅不一）。尤其留意保险杠和车身接缝处，这些地方容易在运输中剐蹭重喷。· 摸边缘：用手顺着车门、引擎盖边缘摸一遍，原厂漆应该是光滑平整的。如果有粗糙的颗粒感或橘皮纹，说明可能后补过漆。· 照缝隙：打开手机闪光灯，照一下前后保险杠与车身的接缝。如果缝隙不均匀、左右不对称，或者卡扣松动，可能车辆拆装过。2. 看轮胎（日期与磨损）轮胎能直接反映车辆是否被长期驾驶过。· 查日期：找到轮胎侧壁的四位数字（例如：3523）。后两位是年份，前两位是周数，3523代表2023年第35周（大约是8月底）生产的。· 关键点：轮胎生产日期必须早于车辆铭牌日期（在副驾B柱下方），但不能太早（比如整车是24年生产的，配了22年的轮胎，可能是库存胎）。同时，四条轮胎的品牌、规格、花纹应完全一致。· 看磨损：新轮胎侧面有彩色线条（生产线标记），胎面上的小橡胶毛（胎毛）应该还在。如果这些都没了，且胎壁有明显磨损，可能被长时间路试过。3. 看玻璃（生产日期）玻璃日期通常标在角落，用数字+小黑点表示（各品牌略有差异，常见规则是数字代表年份，黑点代表月份）。· 规则参考： · 如果黑点在数字后面（如8•），是下半年，用 13 - 黑点数。 · 如果黑点在数字前面（如••8），是上半年，用 7 - 黑点数。· 判断：全车玻璃的生产日期应该非常接近（可能相差几周），且都应早于整车生产日期。如果某一块玻璃日期明显晚于其他几块，或者晚于车辆铭牌日期，说明这块玻璃可能换过。4. 看车身缝隙（钣金工艺）站在车头正前方和车尾正后方，蹲下平视。· 看对齐：观察引擎盖与左右大灯、保险杠的缝隙是否一致。再看车门与车身、车门与车门之间的缝隙是否均匀。豪华品牌这方面通常控制得很好，如果发现某一边缝隙明显大，或者关上门后门板与车身不平齐（有高低落差），可能装配有瑕疵或发生过磕碰修复。5. 看公里数（仪表盘）这决定了车是不是所谓的“0公里”新车。· 正常范围：新车从生产线下来，要经过路试、短驳、上下板车，通常会有一定里程。30公里以内算非常新；50公里以内算正常；如果超过80-100公里，就要留个心眼了（可能是展车或频繁挪动过的试驾车）。· 注意：部分车型支持拔掉ABS传感器线跑，这样里程表不走。所以公里数只能作为参考，最好结合轮胎磨损（胎毛）、刹车盘磨损（有无明显凹槽）来综合判断。最后提醒一下：检查完这些后，启动车辆，把空调开到最大听有没有异响，再检查大灯、雨刮、车窗升降、中控锁等功能是否正常。如果发现轮胎日期晚于生产日期、玻璃日期不一致，或者外观有明显色差，可以要求换一台车。 目的：让你买车时不被套路。","path":"关于汽车/","date":"02-25","excerpt":"","tags":[{"name":"技术","slug":"技术","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"浮生六记-卷一-闺房记乐-二十四","text":"命仆至船艄，与舟子同饮。 船家女名素云，与余有杯酒交，人颇不俗，招之与芸同坐。船头不张灯火，待月快酌，射覆为令。素动双目闪闪，听良久，曰：“觞政侬颇娴习，从未闻有斯令，愿受教。”芸即譬其言而开导之，终茫然。 余笑曰：“女先生且罢论，我有一言作譬，即了然矣。” 芸曰：“鹤善舞而不能耕，牛善耕而不能舞，物性然也，先生欲反而教之，无乃劳乎？” 素云笑捶余肩曰：“汝骂我耶！” 芸出令曰：“只许动口，不许动手。违者罚大觥。”素云量豪，满斟一觥，一吸而尽。 余曰：“动手但准摸索，不准捶人。” 芸笑挽素云，置余怀，曰：“请君摸索畅怀。” 余笑曰：“卿非解人，摸索在有意无意间耳。拥而狂探，田舍郎之所为也。” 时四鬓所簪茉莉，为酒气所蒸，杂以粉汗油香，芳馨透鼻。余戏曰：“小人臭味充满船头，令人作恶。”素云不禁握拳连捶曰：“谁教汝狂嗅耶？”芸呼曰：“违令，罚两大觥！”素云曰：“彼又以小人骂我，不应捶耶？” 芸曰：”彼之所谓小人，盖有故也。请干此，当告汝。” 素云乃连尽两觥，芸乃告以沧浪旧居乘凉事。素云曰：“若然，真错怪矣，当再罚。”又干一觥。 芸曰：“久闻素娘善歌，可一聆妙音否？” 素即以象箸击小碟而歌。芸欣然畅饮，不觉酩酊，乃乘舆先归。余又与素云茶话片刻，步月而回。 时余寄居友人鲁半舫家萧爽楼中。越数日，鲁夫人误有所闻，私告芸曰：“前日闻若婿挟两妓饮于万年桥舟中，子知之否？” 芸曰：“有之，其一即我也。”因以偕游始末详告之。鲁大笑，释然而去。","path":"浮生六记-卷一-闺房记乐-二十四/","date":"02-24","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记-卷一-闺房记乐-二十三","text":"吴江钱师竹病故，吾父信归，命余往吊。 芸私谓余曰：“吴江必经太湖，妾欲偕往，一宽眼界。”余曰：“正虑独行踽踽，得卿同行，固妙，但无可托词耳。”芸曰：“托言归宁。君先登舟，妾当继至。”余曰：“若然，归途当泊舟万年桥下，与卿待月乘凉，以续沧浪韵事。” 时六月十八日也。是日早凉，携一仆先至胥江渡口，登舟而待，芸果肩舆至。解维出虎啸桥，渐见风帆沙鸟，水天一色。 芸曰：“此即所谓太湖耶？今得见天地之宽，不虚此生矣！想闺中人有终身不能见此者！”闲话未几，风摇岸柳，已抵江城。 余登岸拜奠毕，归视舟中洞然，急询舟子。舟子指曰：“不见长桥柳阴下观鱼鹰捕鱼者乎？”盖芸已与船家女登岸矣。 余至其后，芸犹粉汗盈盈，倚女而出神焉。余拍其肩曰：“罗衫汗透矣！” 芸回首曰：“恐钱家有人到舟，故暂避之。君何回来之速也？” 余笑曰：“欲逋逃耳。” 于是相挽登舟，返棹至万年桥下，阳乌犹未落也。舟窗尽落，清风徐来，纨扇罗衫，剖瓜解暑。少焉，霞映桥红，烟笼柳暗，银蟾欲上，渔火满江矣。","path":"浮生六记-卷一-闺房记乐-二十三/","date":"02-23","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"常用命令","text":"Git 配置终端识别名 git config –global user.email “youremail” git config –global user.name “yourname” Git 生成 SSH KEY 并授权 GitHub 项目处理权限 ssh-keygen -t ed25519 -C “&#121;&#x6f;&#x75;&#114;&#x6e;&#97;&#x6d;&#x65;&#64;&#x65;&#x6d;&#x61;&#105;&#x6c;&#x2e;&#x63;&#111;&#109;“ cat ~&#x2F;.ssh&#x2F;id_ed25519.pub 将公钥填写到 GitHub 设置中 ssh -T &#103;&#105;&#116;&#64;&#103;&#x69;&#116;&#x68;&#x75;&#98;&#x2e;&#99;&#x6f;&#109; 测试连接 Git 中显示中文而非转义序列 git config –global core.quotepath false Git 配置代理和取消代理 git config –global http.proxy http://127.0.0.1:7890 git config –global https.proxy http://127.0.0.1:7890 git config –global –unset-all http.proxy git config –global –unset-all https.proxy Git 添加仓库地址，替换仓库地址 git remote add origin https://github.com/utgnim/____.git git remote set-url origin https://github.com/utgnim/_____.git Hexo 命令 hexo –config _config.yml g &amp; hexo –config _config_gal.yml g","path":"常用命令/","date":"02-15","excerpt":"","tags":[{"name":"技术","slug":"技术","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"现象七十二变","text":"黄花岗有七十二个烈士孔老夫子有七十二个弟子孙悟空的魔法七十二变我们又等到民国七十二年岁岁年年风水都在改变有多少沧海一夜变成桑田在这个五千年的悠久历史里面成功与失败多少都有一点清清楚楚写在你的脸上你是个道道地地的聪明人慌慌张张迈开你的脚步你是个匆匆忙忙的现代人有人默默耕耘默默从事有人在过着他的太平日子有人在大白天里彼此明争暗斗有人在黑夜之中枪杀歌手随着都市现代化的程度每个人多少追求一点幸福是个什么样的心理因素每年要吃掉一条高速公路在西门町的天桥上面闲逛有多少文明人在人行道上就像我看到文明车辆横冲直撞我不懂大家心中作何感想一年过了又是新的一年每一年现代都在传统边缘在每个新的一年三百六十五天我们都每天进步一点点眼看着高楼盖得越来越高我们的人情味却越来越薄朋友之间越来越有礼貌只因为大家见面越来越少苹果价钱卖得没以前高或许现在味道变得不好就像彩色的电视变得更加花俏能辨别黑白的人愈来愈少一年过了又是一年每一年都曾经是新的一年在每个新的一年三百六十五天我们都每天进步一点点现实生活不能等待奇迹这是个非常简单的道理如果只要生存非常容易只要你对人保持一点距离但是生活不能像在演戏你戴着面具如何面对自己或许你将会真的发现一些奇迹只要你抛开一些面子问题或许你将会发现人生还算美丽只要你抛开一些面子问题🎼","path":"现象七十二变/","date":"02-13","excerpt":"","tags":[{"name":"歌词","slug":"歌词","permalink":"https://utgnim.github.io/sukebei/tags/%E6%AD%8C%E8%AF%8D/"}]},{"title":"NetIdleShutdown 无网络无操作自动关机小程序[C#]","text":"背景远程操控位于家中的电脑时，偶尔会遇到路由器或光猫当机的情况，网络突然断开，电脑却还没关机，只能等待下次断电路由器或光猫重启才能重新连接上电脑，这就非常耗电，于是有了这个小工具！ 过程由于本人十分的菜，尽管也曾憧憬过成为一个程序员，但一直三分热度、半途而废，到最后不了了之。所以你可以猜到代码并不是我写的。 代码由 Gemini 提供思路，DeepSeek 写成，经历了大约三天的时间，期间不断的请 AI 修改、编译，手动测试，最后终于能够成功运行。经初步短期测试，应该没有什么大问题，故分享出来，代码NetIdleShutdown.cs如下： 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185186187188189190191192193194195196197198199200201202203204205206207208209210211212213214215216217218219220221222223224225226227228229230231232233234235236237238239240241242243244245246247248249250251252253254255256257258259260261262263264265266267268269270271272273274275276277278279280281282283284285286287288289290291292293294295296297298299300301302303304305306307308309310311312313314315316317318319320321322323324325326327328329330331332333334335336337338339340341342343344345346347348349350351352353354355356357358359360361362363364365366367368369370371372373374375376377378379380381382383384385386387388389390391392393394395396397398399400401402403404405406407408409410411412413414415416417418419420421422423424425426427428429430431432433434435436437438439440441442443444445446447448449450451452453454455456457458459460461462463464465466467468469470471472473474475476477478479480481482483484485486487488489490491492493494495496497498499500501502503504505506507508509510511512513514515516517518519520521522523524525526527528529530531532533534535536537538539540541542543544545546547548549550551552553554555556557558559560561562563564565566567568569570571572573574575576577578579580581582583584585586587588589590591592593594595596597598599600601602603604605606607608609610611612613614615616617618619620621622623624625626627628629630631632633634635636637638639640641642643644645646647648649650651652653654655656657658659660661662663664665666667668669670671672673674675676677678679680681682683684685686687688689690691692693694695696697698699700701702703704705706707708709710711712713714715716717718719720721722723724725726727728729730731732733734735736737738739740741742743744745746747748749750751752753754755756757758759760761762763764765766767768769770771772773774775776777778779780781782783784785786787788789790791792793794795796797798799800801using System;using System.Diagnostics;using System.Net.NetworkInformation;using System.Threading;using System.Runtime.InteropServices;using System.Collections.Concurrent;using System.Collections.Generic;using System.Text;using System.Net;using System.Linq;namespace NetIdleShutdown&#123; /// &lt;summary&gt; /// 网络空闲关机程序 /// /// 主要功能： /// 1. 检测网络连接状态（双重检测：Ping + HTTP） /// 2. 检测用户活动状态 /// 3. 当网络断开且用户无操作时，自动执行关机操作 /// /// 检测逻辑： /// - 使用并行线程同时检测多个目标，提高检测速度 /// - 如果所有Ping目标都失败，则直接判断为网络离线 /// - 如果有至少一个Ping成功，则继续进行HTTP检测 /// - 必须同时满足Ping和HTTP检测都至少有一个成功，才判断为在线 /// /// 配置说明： /// - 程序默认配置在AppConfig类中 /// - 可修改默认值或通过构造函数传入自定义配置 /// &lt;/summary&gt; public class NetIdleShutdown : IDisposable &#123; #region 配置类 /// &lt;summary&gt; /// 应用程序配置类 /// 包含所有可配置的参数和检测目标列表 /// &lt;/summary&gt; public class AppConfig &#123; // 核心配置参数 public int MaxNoNetMinutes = 3; // 无网络多少分钟后关机 public int PingTimeoutMs = 1500; // Ping超时时间（毫秒）- 控制线程等待时间 public int HttpTimeoutMs = 5000; // HTTP请求超时时间（毫秒）- 控制线程等待时间 public int CheckIntervalSeconds = 60; // 检测间隔时间（秒）- 主循环等待时间 public int UserIdleThresholdSeconds = 60; // 用户空闲时间阈值（秒）- 判定用户无活动的阈值 // 检测目标列表 public List&lt;string&gt; PingTargets; // Ping检测目标IP地址列表 public List&lt;string&gt; HttpTargets; // HTTP检测目标URL列表 /// &lt;summary&gt; /// 构造函数，初始化默认配置和检测目标 /// &lt;/summary&gt; public AppConfig() &#123; // 初始化Ping检测目标列表 // 包含国内外常用的公共DNS服务器，提高检测可靠性 PingTargets = new List&lt;string&gt; &#123; &quot;223.5.5.5&quot;, // 阿里DNS - 国内常用 &quot;119.29.29.29&quot;, // 腾讯DNS - 国内常用 &quot;180.76.76.76&quot;, // 百度DNS - 国内常用 &quot;1.1.1.1&quot;, // Cloudflare DNS - 国际常用 &quot;8.8.8.8&quot;, // Google DNS - 国际常用 &quot;114.114.114.114&quot;, // 114DNS - 国内常用 &quot;208.67.222.222&quot;, // OpenDNS - 国际备用 &quot;9.9.9.9&quot; // Quad9 DNS - 国际备用 &#125;; // 初始化HTTP检测目标列表 // 使用各大公司的网络连通性检测服务，通常返回204状态码 HttpTargets = new List&lt;string&gt; &#123; &quot;http://connect.rom.miui.com/generate_204&quot;, // 小米网络检测服务 &quot;http://connectivitycheck.gstatic.com/generate_204&quot;, // Google网络检测服务 &quot;http://www.gstatic.com/generate_204&quot;, // Google备用检测服务 &quot;http://www.msftncsi.com/ncsi.txt&quot;, // Microsoft网络检测服务 &quot;http://captive.apple.com/hotspot-detect.html&quot;, // Apple网络检测服务 &quot;http://connectivitycheck.platform.hicloud.com/generate_204&quot; // 华为网络检测服务 &#125;; &#125; &#125; #endregion #region Windows API声明 /// &lt;summary&gt; /// 获取系统最后输入时间的Windows API函数 /// 用于检测用户活动状态 /// &lt;/summary&gt; /// &lt;param name=&quot;plii&quot;&gt;LASTINPUTINFO结构体引用&lt;/param&gt; /// &lt;returns&gt;获取成功返回true，失败返回false&lt;/returns&gt; [DllImport(&quot;user32.dll&quot;)] private static extern bool GetLastInputInfo(ref LASTINPUTINFO plii); /// &lt;summary&gt; /// 最后输入信息结构体 /// 用于存储用户最后输入的时间信息 /// &lt;/summary&gt; [StructLayout(LayoutKind.Sequential)] private struct LASTINPUTINFO &#123; public uint cbSize; // 结构体大小 public uint dwTime; // 最后输入时间（系统启动后的毫秒数） &#125; #endregion #region 私有字段 private readonly AppConfig _config; // 程序配置实例 private int _noNetCounter = 0; // 无网络计数器 private bool _isRunning = true; // 程序运行标志 private readonly object _counterLock = new object(); // 计数器同步锁 #endregion #region 构造函数 /// &lt;summary&gt; /// 构造函数 /// &lt;/summary&gt; /// &lt;param name=&quot;config&quot;&gt;自定义配置，如果为null则使用默认配置&lt;/param&gt; public NetIdleShutdown(AppConfig config = null) &#123; // 使用传入的配置或创建默认配置 _config = config ?? new AppConfig(); // 记录配置信息 Console.WriteLine(&quot;[SYSTEM] 程序配置已加载&quot;); Console.WriteLine(&quot;[SYSTEM] 无网络关机阈值: &quot; + _config.MaxNoNetMinutes + &quot; 分钟&quot;); Console.WriteLine(&quot;[SYSTEM] 检测间隔: &quot; + _config.CheckIntervalSeconds + &quot; 秒&quot;); Console.WriteLine(&quot;[SYSTEM] 用户空闲阈值: &quot; + _config.UserIdleThresholdSeconds + &quot; 秒&quot;); &#125; #endregion #region 主程序入口 /// &lt;summary&gt; /// 启动网络守护程序主循环 /// &lt;/summary&gt; public void Run() &#123; try &#123; // 显示程序标题和配置信息 PrintBanner(); // 主循环：持续检测网络和用户状态 while (_isRunning) &#123; // 执行一次完整的检测周期 PerformCheckCycle(); // 等待指定的间隔时间，每秒检查一次是否停止 for (int i = 0; i &lt; _config.CheckIntervalSeconds &amp;&amp; _isRunning; i++) &#123; Thread.Sleep(1000); &#125; &#125; &#125; catch (Exception ex) &#123; // 记录严重错误并重新抛出 LogError(&quot;程序运行异常&quot;, ex); throw; &#125; &#125; /// &lt;summary&gt; /// 停止守护程序 /// 设置运行标志为false，使主循环退出 /// &lt;/summary&gt; public void Stop() &#123; _isRunning = false; LogInfo(&quot;程序已收到停止指令&quot;); &#125; #endregion #region 检测周期 /// &lt;summary&gt; /// 执行一个完整的检测周期 /// 包括网络检测、用户活动检测和状态处理 /// &lt;/summary&gt; private void PerformCheckCycle() &#123; var timestamp = DateTime.Now; LogInfo(&quot;开始第 &quot; + (_noNetCounter + 1) + &quot; 次检测&quot;); // 检测网络连接状态 bool isOnline = CheckConnectivity(); // 根据网络状态进行相应处理 if (isOnline) &#123; HandleOnlineStatus(timestamp); &#125; else &#123; HandleOfflineStatus(timestamp); &#125; &#125; /// &lt;summary&gt; /// 处理在线状态 /// 网络正常时重置计数器并记录状态 /// &lt;/summary&gt; /// &lt;param name=&quot;timestamp&quot;&gt;检测时间戳&lt;/param&gt; private void HandleOnlineStatus(DateTime timestamp) &#123; lock (_counterLock) &#123; // 如果之前有离线记录，则重置计数器 if (_noNetCounter &gt; 0) &#123; LogInfo(&quot;网络恢复正常，无网络计数器已重置&quot;); _noNetCounter = 0; &#125; &#125; LogInfo(&quot;网络状态: 在线&quot;); &#125; /// &lt;summary&gt; /// 处理离线状态 /// 网络断开时检查用户活动并更新计数器 /// &lt;/summary&gt; /// &lt;param name=&quot;timestamp&quot;&gt;检测时间戳&lt;/param&gt; private void HandleOfflineStatus(DateTime timestamp) &#123; // 检测用户是否有输入活动 bool hasUserActivity = HasUserInputActivity(); if (hasUserActivity) &#123; // 有用户活动，重置计数器 lock (_counterLock) &#123; if (_noNetCounter &gt; 0) &#123; LogInfo(&quot;检测到用户活动，无网络计数器已重置&quot;); _noNetCounter = 0; &#125; &#125; LogInfo(&quot;网络状态: 离线 (用户活动中，不计数)&quot;); &#125; else &#123; // 无用户活动，增加计数器 lock (_counterLock) &#123; _noNetCounter++; &#125; LogInfo(&quot;网络状态: 离线&quot;); LogInfo(&quot;无网络计数器: &quot; + _noNetCounter + &quot;/&quot; + _config.MaxNoNetMinutes); // 检查是否达到关机条件 if (_noNetCounter &gt;= _config.MaxNoNetMinutes) &#123; ExecuteShutdown(); &#125; &#125; &#125; #endregion #region 网络检测 /// &lt;summary&gt; /// 检测网络连接状态 /// /// 检测逻辑： /// 1. 并行执行Ping检测 /// 2. 如果所有Ping目标都失败，直接判断为离线 /// 3. 如果至少有一个Ping成功，则继续进行HTTP检测 /// 4. 必须同时满足Ping和HTTP检测都至少有一个成功，才判断为在线 /// /// 优化：网络完全断开时，最快800ms即可判断为离线 /// &lt;/summary&gt; /// &lt;returns&gt;true表示网络在线，false表示网络离线&lt;/returns&gt; private bool CheckConnectivity() &#123; LogInfo(&quot;开始网络连通性检测&quot;); // 第一步：并行执行Ping检测 bool pingSuccess = PerformPingTestsParallel(); // 第二步：如果Ping检测全部失败，直接判断为离线 if (!pingSuccess) &#123; LogInfo(&quot;Ping检测结果: 全部失败，直接判定为网络离线&quot;); return false; &#125; // 第三步：Ping检测通过，继续进行HTTP检测 LogInfo(&quot;Ping检测结果: 至少有一个成功，开始HTTP检测&quot;); bool httpSuccess = PerformHttpTestsParallel(); // 第四步：必须同时满足Ping和HTTP检测都成功 bool finalResult = pingSuccess &amp;&amp; httpSuccess; // 记录详细检测结果 if (finalResult) &#123; LogInfo(&quot;网络检测最终结果: 在线 (Ping和HTTP检测均通过)&quot;); &#125; else &#123; LogInfo(&quot;网络检测最终结果: 离线 (Ping: &quot; + (pingSuccess ? &quot;成功&quot; : &quot;失败&quot;) + &quot;, HTTP: &quot; + (httpSuccess ? &quot;成功&quot; : &quot;失败&quot;) + &quot;)&quot;); &#125; return finalResult; &#125; /// &lt;summary&gt; /// 并行执行Ping测试 /// /// 实现方式： /// 1. 为每个Ping目标创建一个独立线程 /// 2. 所有线程同时执行，提高检测速度 /// 3. 使用ConcurrentDictionary存储线程安全的结果 /// 4. 使用Interlocked.Increment保证计数器的线程安全 /// /// 超时控制： /// 每个线程最多等待PingTimeoutMs毫秒 /// 超时线程将被强制终止 /// &lt;/summary&gt; /// &lt;returns&gt;true表示至少有一个Ping成功，false表示全部失败&lt;/returns&gt; private bool PerformPingTestsParallel() &#123; LogInfo(&quot;开始并行Ping测试 (目标数: &quot; + _config.PingTargets.Count + &quot;)&quot;); int successCount = 0; // 成功计数器 var results = new ConcurrentDictionary&lt;string, bool&gt;(); // 结果存储 var tasks = new List&lt;Thread&gt;(); // 线程列表 // 为每个Ping目标创建线程 foreach (var target in _config.PingTargets) &#123; var thread = new Thread(() =&gt; &#123; bool result = PingHostFast(target); results[target] = result; if (result) &#123; Interlocked.Increment(ref successCount); &#125; &#125;); thread.Start(); tasks.Add(thread); &#125; // 等待所有线程完成，最多等待PingTimeoutMs毫秒 foreach (var thread in tasks) &#123; if (!thread.Join(_config.PingTimeoutMs)) &#123; // 线程超时，强制终止 thread.Abort(); &#125; &#125; // 输出Ping测试详细结果 var resultBuilder = new StringBuilder(); resultBuilder.AppendLine(&quot;PING检测详细结果:&quot;); foreach (var target in _config.PingTargets) &#123; bool result; if (results.TryGetValue(target, out result)) &#123; string status = result ? &quot;成功&quot; : &quot;失败&quot;; resultBuilder.AppendLine(&quot; &quot; + target.PadRight(15) + &quot; =&gt; &quot; + status); &#125; else &#123; resultBuilder.AppendLine(&quot; &quot; + target.PadRight(15) + &quot; =&gt; 超时&quot;); &#125; &#125; LogInfo(resultBuilder.ToString()); LogInfo(&quot;PING检测统计: 成功 &quot; + successCount + &quot;/&quot; + _config.PingTargets.Count); return successCount &gt; 0; &#125; /// &lt;summary&gt; /// 并行执行HTTP测试 /// /// 检测原理： /// 使用HTTP HEAD方法请求网络连通性检测服务 /// 这些服务通常返回204状态码或2xx状态码 /// 只要返回2xx状态码就认为成功 /// &lt;/summary&gt; /// &lt;returns&gt;true表示至少有一个HTTP请求成功，false表示全部失败&lt;/returns&gt; private bool PerformHttpTestsParallel() &#123; LogInfo(&quot;开始并行HTTP测试 (目标数: &quot; + _config.HttpTargets.Count + &quot;)&quot;); int successCount = 0; var results = new ConcurrentDictionary&lt;string, bool&gt;(); var tasks = new List&lt;Thread&gt;(); // 为每个HTTP目标创建线程 foreach (var url in _config.HttpTargets) &#123; var thread = new Thread(() =&gt; &#123; bool result = TestHttpConnectionFast(url); results[url] = result; if (result) &#123; Interlocked.Increment(ref successCount); &#125; &#125;); thread.Start(); tasks.Add(thread); &#125; // 等待所有线程完成，最多等待HttpTimeoutMs毫秒 foreach (var thread in tasks) &#123; if (!thread.Join(_config.HttpTimeoutMs)) &#123; // 线程超时，强制终止 thread.Abort(); &#125; &#125; // 输出HTTP测试详细结果 var resultBuilder = new StringBuilder(); resultBuilder.AppendLine(&quot;HTTP检测详细结果:&quot;); foreach (var url in _config.HttpTargets) &#123; bool result; if (results.TryGetValue(url, out result)) &#123; string status = result ? &quot;成功&quot; : &quot;失败&quot;; resultBuilder.AppendLine(&quot; &quot; + url + &quot; =&gt; &quot; + status); &#125; else &#123; resultBuilder.AppendLine(&quot; &quot; + url + &quot; =&gt; 超时&quot;); &#125; &#125; LogInfo(resultBuilder.ToString()); LogInfo(&quot;HTTP检测统计: 成功 &quot; + successCount + &quot;/&quot; + _config.HttpTargets.Count); return successCount &gt; 0; &#125; /// &lt;summary&gt; /// 快速Ping单个主机 /// /// 优化点： /// 1. 使用较短的超时时间(800ms)加快检测速度 /// 2. 每次创建新的Ping实例，避免资源竞争 /// 3. 简化异常处理，只返回成功/失败 /// &lt;/summary&gt; /// &lt;param name=&quot;host&quot;&gt;目标主机IP地址&lt;/param&gt; /// &lt;returns&gt;true表示Ping成功，false表示失败或超时&lt;/returns&gt; private bool PingHostFast(string host) &#123; try &#123; using (var ping = new Ping()) &#123; // 使用较短的超时时间加快检测速度 var reply = ping.Send(host, 800); return reply != null &amp;&amp; reply.Status == IPStatus.Success; &#125; &#125; catch (Exception) &#123; // 发生任何异常都视为失败 return false; &#125; &#125; /// &lt;summary&gt; /// 快速测试HTTP连接 /// /// 技术要点： /// 1. 使用HEAD方法，只获取响应头，不下载内容 /// 2. 设置较短的超时时间(2000ms)加快检测速度 /// 3. 设置合适的User-Agent，避免被某些服务拒绝 /// 4. 关闭KeepAlive，避免连接池影响 /// &lt;/summary&gt; /// &lt;param name=&quot;url&quot;&gt;目标URL地址&lt;/param&gt; /// &lt;returns&gt;true表示HTTP请求成功，false表示失败或超时&lt;/returns&gt; private bool TestHttpConnectionFast(string url) &#123; try &#123; // 创建HTTP请求 var request = WebRequest.Create(url) as HttpWebRequest; if (request == null) &#123; return false; &#125; // 配置请求参数 request.Timeout = 2000; // 2秒超时 request.Method = &quot;HEAD&quot;; // 使用HEAD方法 request.UserAgent = &quot;Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36&quot;; request.Accept = &quot;*/*&quot;; request.KeepAlive = false; // 发送请求并获取响应 using (var response = request.GetResponse() as HttpWebResponse) &#123; if (response != null) &#123; // 2xx状态码都视为成功 return (int)response.StatusCode &gt;= 200 &amp;&amp; (int)response.StatusCode &lt;= 299; &#125; return false; &#125; &#125; catch (WebException ex) &#123; // WebException特殊处理：尝试获取响应状态码 if (ex.Response != null) &#123; using (var response = ex.Response as HttpWebResponse) &#123; if (response != null) &#123; // 即使发生WebException，如果返回2xx状态码也算成功 return (int)response.StatusCode &gt;= 200 &amp;&amp; (int)response.StatusCode &lt;= 299; &#125; &#125; &#125; return false; &#125; catch (Exception) &#123; // 其他异常都视为失败 return false; &#125; &#125; #endregion #region 用户活动检测 /// &lt;summary&gt; /// 检测用户输入活动 /// /// 检测原理： /// 1. 通过Windows API获取系统最后输入时间 /// 2. 计算当前时间与最后输入时间的差值 /// 3. 如果差值小于阈值，则认为用户有活动 /// /// 注意：只检测键盘和鼠标输入活动 /// &lt;/summary&gt; /// &lt;returns&gt;true表示用户有输入活动，false表示用户空闲&lt;/returns&gt; private bool HasUserInputActivity() &#123; try &#123; uint idleTimeMs = GetUserIdleTime(); uint thresholdMs = (uint)_config.UserIdleThresholdSeconds * 1000; bool hasActivity = idleTimeMs &lt; thresholdMs; // 记录详细的空闲时间信息 LogInfo(&quot;用户活动检测: &quot; + (hasActivity ? &quot;有活动&quot; : &quot;无活动&quot;) + &quot; (空闲时间: &quot; + (idleTimeMs / 1000) + &quot; 秒)&quot;); return hasActivity; &#125; catch (Exception ex) &#123; // 用户活动检测失败时，默认返回无活动（保守策略） LogError(&quot;用户活动检测异常&quot;, ex); return false; &#125; &#125; /// &lt;summary&gt; /// 获取用户空闲时间（毫秒） /// /// 实现方式： /// 1. 调用GetLastInputInfo获取系统最后输入时间 /// 2. 计算当前系统运行时间与最后输入时间的差值 /// 3. 返回用户空闲的毫秒数 /// /// 注意：Environment.TickCount在49.7天后会回绕，但这里影响不大 /// &lt;/summary&gt; /// &lt;returns&gt;用户空闲时间（毫秒）&lt;/returns&gt; private uint GetUserIdleTime() &#123; var lastInputInfo = new LASTINPUTINFO(); lastInputInfo.cbSize = (uint)Marshal.SizeOf(lastInputInfo); if (GetLastInputInfo(ref lastInputInfo)) &#123; // 计算空闲时间 = 当前时间 - 最后输入时间 return (uint)Environment.TickCount - lastInputInfo.dwTime; &#125; // API调用失败时返回最大值，表示用户已长时间空闲 return uint.MaxValue; &#125; #endregion #region 关机操作 /// &lt;summary&gt; /// 执行关机操作 /// /// 执行步骤： /// 1. 检查管理员权限 /// 2. 使用shutdown.exe执行关机命令 /// 3. 设置立即关机(/s /f /t 0) /// /// 参数说明： /// /s: 关机 /// /f: 强制关闭所有应用程序 /// /t 0: 延迟0秒 /// &lt;/summary&gt; private void ExecuteShutdown() &#123; try &#123; LogWarning(&quot;已达到关机条件，准备执行关机操作&quot;); // 权限检查：关机需要管理员权限 if (!IsRunningAsAdministrator()) &#123; LogError(&quot;执行关机操作需要管理员权限，请以管理员身份运行本程序&quot;); return; &#125; // 配置关机命令参数 var psi = new ProcessStartInfo &#123; FileName = &quot;shutdown.exe&quot;, Arguments = &quot;/s /f /t 0&quot;, CreateNoWindow = true, UseShellExecute = false &#125;; // 执行关机命令 using (var process = Process.Start(psi)) &#123; // 等待命令执行 Thread.Sleep(1000); &#125; LogWarning(&quot;关机命令已发送，系统将立即关闭&quot;); Stop(); // 停止程序主循环 &#125; catch (Exception ex) &#123; LogError(&quot;执行关机操作失败&quot;, ex); &#125; &#125; /// &lt;summary&gt; /// 检查是否以管理员权限运行 /// /// 实现方式： /// 1. 获取当前Windows身份标识 /// 2. 检查是否属于Administrators组 /// /// 注意：Windows Vista及以上版本需要UAC提升 /// &lt;/summary&gt; /// &lt;returns&gt;true表示以管理员权限运行，false表示不是管理员&lt;/returns&gt; private bool IsRunningAsAdministrator() &#123; try &#123; var identity = System.Security.Principal.WindowsIdentity.GetCurrent(); var principal = new System.Security.Principal.WindowsPrincipal(identity); return principal.IsInRole(System.Security.Principal.WindowsBuiltInRole.Administrator); &#125; catch &#123; // 权限检查失败时，默认返回false（保守策略） return false; &#125; &#125; #endregion #region 日志输出 /// &lt;summary&gt; /// 输出程序标题和配置信息 /// &lt;/summary&gt; private void PrintBanner() &#123; Console.WriteLine(&quot;===============================================&quot;); Console.WriteLine(&quot;网络空闲关机程序 - NetIdleShutdown&quot;); Console.WriteLine(&quot;版本: 1.0&quot;); Console.WriteLine(&quot;作者: System&quot;); Console.WriteLine(&quot;===============================================&quot;); Console.WriteLine(&quot;功能说明:&quot;); Console.WriteLine(&quot;- 当网络断开且用户无操作时，自动执行关机&quot;); Console.WriteLine(&quot;- 检测策略: 双重检测 (Ping + HTTP)&quot;); Console.WriteLine(&quot;- 检测方式: 并行多线程检测&quot;); Console.WriteLine(&quot;===============================================&quot;); Console.WriteLine(&quot;当前配置:&quot;); Console.WriteLine(&quot;- 无网络关机阈值: &quot; + _config.MaxNoNetMinutes + &quot; 分钟&quot;); Console.WriteLine(&quot;- 检测间隔: &quot; + _config.CheckIntervalSeconds + &quot; 秒&quot;); Console.WriteLine(&quot;- 用户空闲阈值: &quot; + _config.UserIdleThresholdSeconds + &quot; 秒&quot;); Console.WriteLine(&quot;- Ping检测目标: &quot; + _config.PingTargets.Count + &quot; 个&quot;); Console.WriteLine(&quot;- HTTP检测目标: &quot; + _config.HttpTargets.Count + &quot; 个&quot;); Console.WriteLine(&quot;===============================================&quot;); Console.WriteLine(&quot;&quot;); &#125; /// &lt;summary&gt; /// 记录信息级别日志 /// 用于记录程序正常运行状态信息 /// &lt;/summary&gt; /// &lt;param name=&quot;message&quot;&gt;日志消息&lt;/param&gt; private void LogInfo(string message) &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [INFO] &quot; + message); &#125; /// &lt;summary&gt; /// 记录警告级别日志 /// 用于记录需要注意但不影响程序继续运行的情况 /// &lt;/summary&gt; /// &lt;param name=&quot;message&quot;&gt;日志消息&lt;/param&gt; private void LogWarning(string message) &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [WARN] &quot; + message); &#125; /// &lt;summary&gt; /// 记录错误级别日志 /// 用于记录程序运行中的错误和异常 /// &lt;/summary&gt; /// &lt;param name=&quot;message&quot;&gt;日志消息&lt;/param&gt; /// &lt;param name=&quot;ex&quot;&gt;异常对象（可选）&lt;/param&gt; private void LogError(string message, Exception ex = null) &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [ERROR] &quot; + message); if (ex != null) &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [ERROR] 异常类型: &quot; + ex.GetType().Name); Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [ERROR] 异常消息: &quot; + ex.Message); &#125; &#125; #endregion #region 资源清理 /// &lt;summary&gt; /// 释放程序资源 /// 实现IDisposable接口，支持using语句 /// &lt;/summary&gt; public void Dispose() &#123; _isRunning = false; LogInfo(&quot;程序资源已释放&quot;); &#125; #endregion &#125; /// &lt;summary&gt; /// 程序主入口类 /// 包含Main方法和程序启动逻辑 /// &lt;/summary&gt; public static class Program &#123; /// &lt;summary&gt; /// 应用程序主入口点 /// /// 主要流程： /// 1. 创建NetIdleShutdown实例 /// 2. 设置Ctrl+C中断处理 /// 3. 运行网络检测主循环 /// 4. 处理异常并优雅退出 /// &lt;/summary&gt; /// &lt;param name=&quot;args&quot;&gt;命令行参数（当前版本未使用）&lt;/param&gt; public static void Main(string[] args) &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [SYSTEM] 程序启动中...&quot;); using (var shutdown = new NetIdleShutdown()) &#123; // 设置控制台关闭事件处理（Ctrl+C） Console.CancelKeyPress += (sender, e) =&gt; &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [SYSTEM] 收到中断信号，正在停止程序...&quot;); shutdown.Stop(); e.Cancel = true; // 防止程序立即退出 &#125;; try &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [SYSTEM] 程序已启动，开始网络监控&quot;); shutdown.Run(); &#125; catch (Exception ex) &#123; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [SYSTEM] 程序运行失败: &quot; + ex.Message); Environment.Exit(1); &#125; &#125; Console.WriteLine(&quot;[&quot; + DateTime.Now.ToString(&quot;yyyy-MM-dd HH:mm:ss&quot;) + &quot;] [SYSTEM] 程序已退出&quot;); &#125; &#125;&#125; 成品 NetIdleShutdown.cs 3 分钟版 3minNetIdleShutdown.exe 30 分钟版 30minNetIdleShutdown.exe GitHub地址 https://github.com/utgnim/NetIdleShutdown.cs.git","path":"NetIdleShutdown-无网络无操作自动关机小程序-C/","date":"02-13","excerpt":"","tags":[{"name":"技术","slug":"技术","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"浮生六记-卷一-闺房记乐-二十二","text":"离余家半里许，醋库巷有洞庭君祠，俗呼水仙庙。 回廊曲折，小有园亭，每逢神诞，众姓各认一落，密悬一式之玻璃灯，中设宝座，旁列瓶几，插花陈设，以较胜负。日惟演戏，夜则参差高下，插烛于瓶花间，名曰“花照”。花光灯影，宝鼎香浮，若龙宫夜宴。司事者或笙箫歌唱，或煮茗清谈，观者如蚁集，檐下皆设栏为限。 余为众友邀去，插花布置，因得躬逢其盛。归家向芸艳称之，芸曰：“惜妾非男子，不能往。”余曰：“冠我冠，衣我衣，亦化女为男之法也。”于是易髻为辫，添扫蛾眉；加余冠，微露两鬓，尚可掩饰；服余衣，长一寸又半，于腰内折而缝之，外加马褂。芸曰：“脚下将奈何？”余曰：“坊间有蝴蝶履，大小由之，购之极易，且早晚可代撒鞋之用，不亦善乎？”芸欣然。 及晚餐后，装束既毕，效男子拱手阔步良久，忽变卦曰：“妾不去矣，为人识出，既不便，堂上闻之又不可。”余怂恿曰：“庙中司事者谁不知我，既识出，亦不过付之一笑耳。吾母现在九妹丈家，密去密来，焉得知之。” 芸揽镜自照，狂笑不已。余强挽之，悄然径去。遍游庙中，无识出为女子者。或问何人，以表弟对，拱手而已。 最后到一处，有少妇、幼女坐于所设宝座后，乃杨姓司事者之眷属也。芸忽趋彼通款曲，身一侧，而不觉一按少妇之肩，旁有婢媪怒而起曰：“何物狂生，不法乃尔！”余试为措词掩饰，芸见势恶，即脱帽翘足示之曰：“我亦女子耳。”相与愕然，转怒为欢，留茶点，唤扁舆送归。","path":"浮生六记-卷一-闺房记乐-二十二/","date":"01-27","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"关于 Windows Server 2022 安装在笔记本上一些内容整理参考","text":"近来心血来潮想给笔记本电脑重装系统，遇到的一些问题及解决方案，遂记录汇总； 前人栽树，后人乘凉，感谢各位大大的帖子指引，帮助很多； 本方案基于 zh-cn_windows_server_2022_x64_dvd_6c73507d.iso 进行，未在其他系统镜像上进行过测试，因此不保证通用性。 正文一、安装镜像下载：最初版本： BT下载： magnet:?xt&#x3D;urn:btih:0A63B2E08D5D154A79D408040BE4994917C223D3&amp;dn&#x3D;zh-cn_windows_server_2022_x64_dvd_6c73507d.iso 123盘：https://www.123pan.com/s/iBU9jv-zYJNh.html （123盘电脑浏览器解除限速下载限制，可使用油猴脚本 https://github.com/hmjz100/LinkSwift ） Windows Server 2022 (x64) - DVD (Chinese-Simplified) 文件：zh-cn_windows_server_2022_x64_dvd_6c73507d.iso 大小：5.41GB MD5：A93A5845D924F99ADEC1432A5D69103B SHA1：0DF46441DD01F99459FB75BDB732E7904900A0D7 SHA256：E77BB4618182D1E5D0B39DA7E72354F4167EBB859428E7482587DD5A2A72F599 资源来自： https://next.itellyou.cn/ https://hellowindows.cn/ 最新版本可在远景论坛内各大大发布的资源贴内下载 二、调整优化具体操作步骤大致如下： 全新安装 Windows 10 或 Windows 11，安装全部驱动，确保各功能（触控板、指纹等）可正常使用 使用 Dism++ [ https://github.com/Chuyu-Team/Dism-Multi-language/releases ] 中的 驱动管理 导出驱动（不要勾选 显示适配器，也即显卡的驱动）到非系统盘中的任意文件夹中（以下将该目录称为【驱动备份目录】） 下载帖子 分享国外大神提供的Server 2022 蓝牙HID驱动，解决蓝牙外设能配对不能连接的问题 [ https://bbs.pcbeta.com/viewthread-1942811-1-1.html ] 中的附件【Bluetooth_HID.zip 】，解压到上面的的【驱动备份目录】中 解压下载的 zh-cn_windows_server_2022_x64_dvd_6c73507d.iso 镜像文件到一个目录（下称【镜像目录】），使用 Dism++ 挂载该目录下的 install.wim ，目标镜像 记得选择带图形化界面的（比如 Windows Server 2022 Standard (Desktop Experience) 或者 Windows Server 2022 Datacenter (Desktop Experience)） 使用 Dism++ 中的 驱动管理 功能中的 添加驱动【驱动备份目录】中的驱动到挂载的镜像中，然后 保存镜像 选择 增量保存，最后 卸载镜像 通过 微PE 等 PE 系统 或者直接启动【镜像目录】中的镜像 安装修改后的镜像 参考帖子 Server 2022 改造为个人工作站系统的调整和优化 [ https://bbs.pcbeta.com/viewthread-1911508-1-1.html ] 中的内容进行调整 三、驱动问题到这一步 触控板 和 指纹 还无法使用 『可能还有 蓝牙音频驱动 无法解决，但由于本人没有蓝牙音频设备，无法进行测试，仅提供解决方法指引 让server 2022 支持蓝牙耳机的方法，测试可用，请用V3附件 [ https://bbs.pcbeta.com/viewthread-1930349-1-1.html ]』 触控板解决方案（自签名思路，无需开启测试模式即可加载驱动） 使用 7z 打开【镜像目录】中的 \\sources\\boot.wim ，提取 \\1\\Windows\\INF 中的 hidi2c.inf 文件和 \\1\\Windows\\System32\\drivers 中的 hidi2c.sys 文件到一个目录中（下称【触控板驱动】） 参考 [https://github.com/PIKACHUIM/FakeSign] 进行签名• 需要安装时间证书信任工具 [ https://github.com/PIKACHUIM/FakeSign/raw/refs/heads/main/Releases/PikachuTestCert.exe ]• 需要安装 WDK [ https://learn.microsoft.com/zh-cn/windows-hardware/drivers/download-the-wdk ]，并根据安装目录自行设置环境变量，如 C:\\Program Files (x86)\\Windows Kits\\10\\bin\\10.0.***.0\\x86，确保 inf2cat.exe 能被 cmd 直接调用• 但是中间会出现问题，不允许把系统文件“重新打包”进驱动目录的错误，需要改 hidi2c.inf 安装 hidi2c.sys 驱动为绑定 hidi2c.sys 驱动，于是请 Microsoft Copilot 写了一个针对自己设备 硬件ID 的 hidi2c-elan-bind.inf 文件，利用该方法签名，安装后，触控板即恢复正常 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950; hidi2c-elan-bind.inf; Bind ELAN2203 I2C HID devices to the in-box Microsoft hidi2c.sys without redistributing binaries.[Version]Signature = &quot;$Windows NT$&quot;Class = HIDClassClassGuid = &#123;745a17a0-74d3-11d0-b6fe-00a0c90f57da&#125;Provider = %MSFT%DriverVer = 01/01/2015,1.0.1.0CatalogFile = hidi2c_elan_bind.cat[ControlFlags]ExcludeFromSelect = *[Manufacturer]%MSFT% = Microsoft, NTx86, NTamd64[Microsoft.NTx86]%ELAN.DeviceDesc% = hidi2c.Bind.Install, ACPI\\VEN_ELAN&amp;DEV_2203%ELAN.DeviceDesc% = hidi2c.Bind.Install, ACPI\\ELAN2203%ELAN.DeviceDesc% = hidi2c.Bind.Install, *ELAN2203[Microsoft.NTamd64]%ELAN.DeviceDesc% = hidi2c.Bind.Install, ACPI\\VEN_ELAN&amp;DEV_2203%ELAN.DeviceDesc% = hidi2c.Bind.Install, ACPI\\ELAN2203%ELAN.DeviceDesc% = hidi2c.Bind.Install, *ELAN2203; Bind to the in-box hidi2c installation logic (no CopyFiles, no ServiceBinary)[hidi2c.Bind.Install]Include = hidi2c.infNeeds = hidi2c_Device.NT[hidi2c.Bind.Install.HW]Include = hidi2c.infNeeds = hidi2c_Device.NT.HWAddReg = hidi2c_Device.Configuration.AddReg.Override[hidi2c.Bind.Install.Services]Include = hidi2c.infNeeds = hidi2c_Device.NT.Services; Optional: override/append device configuration values (safe per-device HKR writes)[hidi2c_Device.Configuration.AddReg.Override]HKR,,&quot;EnhancedPowerManagementEnabled&quot;,0x00010001,1HKR,,&quot;DeviceResetNotificationEnabled&quot;,0x00010001,1HKR,,&quot;LegacyTouchScaling&quot;,0x00010001,0[Strings]MSFT = &quot;Microsoft&quot;ELAN.DeviceDesc = &quot;ELAN I2C HID Device (Bind to in-box hidi2c)&quot; 特别注意 提供的文件不能直接使用，需要 更改为 你自己的设备 硬件ID，然后重新签名； 微软有一个黑名单会禁止使用这些签名用的泄露的证书，如果你系统里的 黑名单 中有为驱动签名的证书，那可能就无法使用该方法了； 有帖子 windows10及以上本地驱动加载黑名单查看 [ https://bbs.kanxue.com/thread-273316.htm ] 提供有修改该黑名单的方法，但本人没有验证过，无法确定更改后是否即可恢复正常； 如果你信任我，也可以发 硬件ID 和 驱动文件 给我，我可以帮你签。当然“我不能保证这个文件一定能工作，也不能保证它不会损坏你的计算机，你将需要自行承担可能存在的风险。” 参考资料Windows Server 2019&#x2F;2022 i2c 触摸屏&#x2F;触摸板无法使用的解决方法 [ https://www.bilibili.com/opus/884213704738996247 ] 指纹解决方案（通过替换 CredentialEnrollmentManager.exe 解锁）参考 给 Windows Server 2022 配置 Windows Hello 指纹解锁 [ https://afa31148-4a8c-4113-a92f-72626cd2a27b.x.wtf/2021/fingerprint-unlocking-for-windows-server-2022/ ] 下面是请 Copilot 写的的替换命令，需要用到工具 NSudo [ https://github.com/M2TeamArchived/NSudo/releases ] 1234567891011121314151617181920212223REM === 使用 NSudo 打开 TrustedInstaller 权限的命令行后，逐行执行以下命令 ===REM Step 1: 备份原始文件和 ACLtakeown /f &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot;icacls &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot; /save &quot;D:\\backup\\CredentialEnrollmentManager_acl.txt&quot;copy &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot; &quot;D:\\backup\\CredentialEnrollmentManager.exe&quot;REM Step 2: 替换为自定义文件copy /Y &quot;D:\\..你下载文件保存的目录..\\CredentialEnrollmentManager.exe&quot; &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot;REM Step 3: 恢复原始 ACL 权限icacls &quot;C:\\Windows\\System32&quot; /restore &quot;D:\\backup\\CredentialEnrollmentManager_acl.txt&quot;REM Step 4: 可选 - 设置只读属性，防止更新覆盖attrib +R &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot;REM Step 5: 可选 - 拒绝 TrustedInstaller 写入（需谨慎）icacls &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot; /deny &quot;NT SERVICE\\TrustedInstaller&quot;:(W)REM === 回滚方法（如需恢复原始文件） ===copy /Y &quot;D:\\backup\\CredentialEnrollmentManager.exe&quot; &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot;icacls &quot;C:\\Windows\\System32&quot; /restore &quot;D:\\backup\\CredentialEnrollmentManager_acl.txt&quot;attrib -R &quot;C:\\Windows\\System32\\CredentialEnrollmentManager.exe&quot; 然后你需要新建一个用户，切换到该用户才能使用指纹，但是这样一来就需要重新调整设置，不太优雅； 因此我推荐使用 Forensit [ https://www.forensit.com/downloads.html ] 里的 User Profile Wizard Release 24 [ https://www.forensit.com/Downloads/Profwiz.msi ]，该工具可以直接将当前 Administrator 的用户配置迁移到 其他用户 下； 需要注意的一点是新建用户后不注销，直接使用该工具迁移，似乎可以直接使用 C:\\Users\\Administrator 作为新用户的目录来使用，但我不确定这样操作是否正确，有没有隐患 四、其它可能用到的工具：Microsoft Activation Scripts (MAS): [ https://massgrave.dev/ ] Microsoft Defender &amp; Windows Update 开关 [ https://bbs.pcbeta.com/viewthread-1913968-1-1.html ] 微软常用运行库合集_By:Dreamcast [ https://wwa.lanzout.com/b0b8rs19a#9527 ] 至此，安装结束！ 二〇二五年九月二十九日夜 补充 关于 蓝牙音频驱动 这个似乎可以用，但不清楚是否和系统自己带的 个人局域网服务 有什么区别，装上就没有叹号了，但我没有蓝牙音频设备无法测试设备是否可以正常连接使用，驱动程序提供商是 Broadcom 下载来源：[ https://geek-speak.ru/download/driver-ms_bthpan/ ] 病毒检测：[ https://www.virustotal.com/gui/file/82f5fda2dcb57419413b7a7284ce6e3c1b1049f43a44245e5e22e010fb73b34f ] 另外有个一劳永逸的方法，不用需要费力给驱动签名消除叹号，相当于每次开机默认以 关闭驱动程序强制验证 选项开机，缺点就是每次开机，开机界面都会有一堆命令显示 纠正，需要每次开机重新执行一遍 EfiDSEFix.exe -d 才行，可以结合 任务计划程序 设置开机自动运行，并且加上 禁用 启用 没有数字签名的设备命令，需要用到 WDK 里的 devcon.exe 项目地址：[ https://github.com/Mattiwatti/EfiGuard ] （在 [ https://github.com/PIKACHUIM/FakeSign/issues/9 ] 这里了解到该项目） 使用的前提条件是 内存完整性（HVCI）为关闭状态 步骤如下： 下载 [ https://github.com/Mattiwatti/EfiGuard/releases/download/v1.4/EfiGuard-v1.4.zip ]，解压到任意目录（下称【EfiGuard 目录】 ），不要删除 使用 DiskGenius 或其他工具，将 EfiGuardDxe.efi Loader.efi 两个文件复制到 \\EFI\\Boot 下面 配合 EasyUEFI 新建启动项，并设置为 Loader.efi ，然后将新建的启动项调整为首位，重启后界面会有命令执行过程显示 开机后，以管理员身份运行 命令行窗口，切换到【EfiGuard 目录】 执行 EfiDSEFix.exe -d ，就会禁用 Driver Signature Enforcement（驱动程序签名强制） 此时再安装没有经过微软签名的驱动，也不会有叹号出现了 由于关闭了 驱动程序强制验证，以后安装程序要谨慎一点，否则电脑很容易中招","path":"关于-Windows-Server-2022-安装在笔记本上一些内容整理参考/","date":"09-29","excerpt":"","tags":[{"name":"技术","slug":"技术","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"评普鲁士最近的书报检查令","text":"马克思（1842 年 2 月） 《评旁观者最近的书报检查令》是卡尔·马克思的第一篇政论性文章，他的政治活动就是从这时开始的，当时他是一个革命民主主义者。 19 世纪 40 年代初，德国正处于资产阶级革命的前夜，争取自由和民主的运动非常高涨，所以本文所谈到的问题，即关于普鲁士的出版状况问题，在当时显得特别尖锐。普鲁士政府于 1841 年 12 月 24 日颁布的新书报检查令，在表面上表示不赞成对作家的写作活动加以限制，实际上不仅保存了反动的普鲁士的书报检查制度，而且更加强了这种制度。 马克思这篇揭露新检查令的虚伪自由主义的文章，没有在德国发表。这篇文章是在 1842 年 1 月 15 日至 2 月 10 日间写成的，但直到 1843 年 2 月才在瑞士发表，载于《德国现代哲学和政论界轶文集》（《Anekdota zur neuesten deutschen Philosophie und Publicistik》）第 1 卷。阿·卢格出版的这一文集（两卷集），除卡尔·马克思的两篇文章之外，还收集了布·鲍威尔、路·费尔巴哈、费·科本以及阿·卢格等人的文章。 1851 年，海·贝克尔开始在科伦出版卡尔·马克思文集（Gesammelte Aufsatze von Karl Marx, herausgegeben von Hermann Becker. I. Heft, Koln, 1851），马克思把《评普鲁士最近的书报检查令》这一篇文章作为该文集的第一篇。由于普鲁士政府的查禁，这一版本在第一版出版后即被禁止发行 我们不是那种心情不满的人，不会在普鲁士新的书报检查法令公布之前就声明说：Tieo Danaos et dona ferentes ［即便丹纳士人带来礼物，我还是怕他们］[1]。相反，因为新的检查令允许对已经颁布的法律进行讨论，哪怕这种讨论和政府的观点不一致，所能，我们现在就从这一检查令本身谈起。书报检查就是官方的批评。书报检查的标准就是批评的标准，因此，就很难把这种标准同批评分割开来，因为它们是建立同一个基础上的。 当然，对于检查令序言中所表述的一般倾向，每个人都只能表示赞同： “为了使新闻出版现在就能摆脱那些未经许可的、违背陛下旨意的限制，国王陛下曾于本月 10 日下诏王室内阁，明确反对使写作活动受到各种无理的约束。国王陛下承认公正的、合乎礼貌的公众言论是重要的而且必需的，并授权我们再度现成书报检查官切实遵守 1819 年 10 月 18 日书报检查法令第 2 条的规定。” 当然！既然书报检查是必要的，那么公正的、自由的书报检查就更加必要了。 可是，这里有一点马上就会使人们感到有点诧异，那就是上述法律的日期。该法律颁布的日期是 1819 年 10 月 18 日。怎么？难道这是一项由于时势所迫而废除了的法律吗？看来不是，因为现在不过是“再度”现成书报检查官必须遵守这一法律。由此可见，这一法律 1842 年以前一直存在，不过没有实施罢了。正因为如此，现在才又提起它，“为了”使新闻出版“现在就能摆脱那些未经许可的、违背陛下旨意的限制。 尽管有了法律法律，但是新闻出版物到目前为止仍然受到种种未经许可的限制，这就是从上述书报检查令的序言中得出的直接结论。 上面的话是针对法律，还是针对书报检查官呢？ 我们未必有理由能肯定说是后一种情况。在 22 年当中，保护公民的最高利益即他们的精神的主管机关，一直在进行非法的活动，这一机关的权力简直比罗马的书报检查官还要大，因为它不仅管理个别公民的行为，而且甚至管理公众精神的行为。在组织完善的、以自己的行政机关自豪的普鲁士国家里，政府高级官员的这种不负责任的行为。在组织完善的以自己的行政机关自豪的普鲁士国家里，政府高级官员的这种不负责任的行为，这种一贯的不忠诚的行为，难道可能发生吗？还是国家总是盲目地挑选最无能的人去担任最艰巨的职务呢？最后，也许是普鲁士国家的臣民已根本不可能起来抗议这种违法的行为吧？难道普鲁士的所有作者都如此愚昧无知，连与自己生存有关的法律也不知道吗？还是他们的胆子太小，竟不敢要求实施这种法律呢？ 假如我们把过错推在书报检查官身上，那么这不仅会败坏他们本身的名誉，而且会败坏普鲁士国家和普鲁士作者的名誉。 况且，如果书报检查官二十多年来一直进行无视法律的非法活动，那就会提供 argumentum ad hominem ［令人信服的证据］[2]，说明新闻出版需要的是别的保证，而不是给如此不负责任的人物发出的这种一般性的指令。那就会证明书报检查制度骨子里隐藏着一种用任何法律者无法消除的根本缺陷。 可是，如果说书报检查官很中用，不中用的是法律，那么，为什么还要再度求助于法律去反对正是它本身所造成的祸害呢？ 或者，也许为了造成一种改善的假象而不从本质上去改善事物，才需要把制度本身的客观缺点归咎于个人吧？虚伪自由主义的手法通常总是这样的：在被迫让步时，它就牺牲人这个工具，而保全事物本身，即制度。这进就会转移从表面看问题的公众的注意力。 对事物本身的愤恨就会变成对某些人的愤恨。有些人以为人一变换，事物本身也就会起变化。人们的注意力就从书报检查制度转移到了个别书报检查官身上，而那一伙专看官方眼色行事的卑劣作者，便放心大胆地反对那些不受宠幸的人，对政府却称颂备至。 在我们面前还有一个困难。 某些报纸的记者认为，书报检查令就是新的书报检查法令。他们错了，不过他们的这种错误是情有可原的。1819 年 10 月 18 日的书报检查法令只应当暂时有效，即到 1823 年为止有效，如果不是现在的书报检查令告诉我们上述法令从来没有被实施过，那么直到今天它仍然是一项临时性的法律。 1819 年的法令也是一项过渡性措施，不过，当时规定了一定的期限——五年，可以期望颁布永久性法律，而新的检查令却没有规定任何期限；其次，当时期望颁布的是关于新闻出版自由的法律，而现在期望颁布的则是关于书报检查的法律。 另一些报纸的记者则认为，这个书报检查令是旧的书报检查法令的翻新。检查令本身将驳倒他们这种错误的看法。 我们认为，书报检查令是可能要颁布的书报检查法的精神的预示。在这一点上，我们是严格遵循 1819 年书报检查法令的精神的，根据这一法令，邦的法律和命令对新闻出版具有同样的作用（参看上述法令第 16 条第 2 款）。 现在我们再回过头来看看检查令。 “根据这一法律〈即根据第 2 条规定〉书报检查不得阻挠人们对真理作严肃和谦逊的探讨，不得使作者受到无理的约束，不得妨碍书籍在书市上自由流通。” 书报检查不得阻挠的对真理的探讨，在这里有了更具体的规定：这就是严肃和谦逊的探讨。这两个规定要求探讨注意的不是内容，而无宁说是内容以外的某种东西。这些规定一开始就使探讨脱离了真理，并硬要它把注意力转移到某个莫名其妙的第三者身上。可是，如果探讨老是去注意这个由法律赋予挑剔权的第三者，难道它不是会忽视真理吗？难道真理探讨者的首要义务不就是直奔真理，而不要东张西望吗？假如我必须记住用指定的形式来谈论事物，难道我不是会忘记谈论事物本身吗？ 真理像光一样，它很难谦逊；而且要它对谁谦逊呢？对它本身吗？Verum index sui et falsi ［真理是检验它自身和谬误的试金石］[3]。那么是以谬误吗？ 如果谦逊是探讨的特征，那么，这与其说是害怕谬误的标志，不如说是害怕真理的标志。谦逊是使我寸步难行的绊脚石。它就是规定在探讨时要对得出结论感到恐惧，它是一种对付真理的预防剂。 其次，真理是普遍的，它不属于我一个人，而为大家所有；真理占有我，而不是我占有真理。我只有构成我的精神个性的形式。“风格如其人。”可是实际情形怎样呢！法律允许我写作，但是不允许我用自己的风格去写，我只能用另一种风格去写！我有权利表露自己的精神面貌，但是首先必须使这种面貌具有一种指定的表情！哪一个正直的人不为这种无理的要求脸红，而宁愿把自己的脑袋藏到罗马式长袍里去呢？至少可以预料在那长袍下面有一个丘必特的脑袋。指定的表情只不过意味着“强颜欢笑”而已。 你们赞美大自然令人赏心悦目的千姿百态和无穷无尽的丰富宝藏，你们并不要求玫瑰花散发出和紫罗兰一样的芳香，但你们为什么却要求世界上最丰富的东西——精神只能有一种存在形式呢？我是一个幽默的人，可是法律却命令我用严肃的笔调。我是一个豪放不羁的人，可是法律却指定我用谦逊的风格。一片灰色就是这种自由所许可的唯一色彩。每一滴露水在太阳的照耀下者闪现着无穷无尽的色彩。但是精神的太阳，无论它照耀着多少个体，无论它照耀什么事物，却只准产生一种色彩，就是官方的色彩！精神的最主要形式是欢乐、光明，但你们却要使阴暗成为精神的唯一合适的表现；精神只准穿着黑色的衣服，可是花丛中却没有一枝黑色的花朵。精神的实质始终就是真理本身，而你们要把什么东西变成精神的实质呢？谦逊。歌德说过，只有怯懦者才是谦逊的，你们想把精神变成这样的怯懦者吗？也许，这种谦逊应该是席勒所说的那种天才的谦逊？𨃢是这样的话，那你们就先要把自己的全体公民、特别是你们所有的书报检查官者变成天才。况且天才的谦逊当然不像文雅的语言那样，避免使用乡音和土语，相反，天才的谦逊恰恰在于用事物本身的乡音和表达事物本质的土语来说话。天才的谦逊是要忘掉谦逊和不谦逊，使事物本身突现出来。精神的谦逊总的说来就是理性，就是按照事物的本质特征去对待各种事物的那种普遍的思想自由。 其次，根据特利斯屈兰·善第所下的定义：严肃是肉体为掩盖灵魂缺陷而做出的一种虚伪姿态。如果严肃不应当适合这个定义，如果严肃的意思应当是注重实际的态度，那么这整个规定就会失去意义。因为我把可笑的事物看成是可笑的，这就是对它采取严肃的态度；对不谦逊仍然采取谦逊的态度，这也就是精神最大的不谦逊。 严肃和谦逊！这是多么不固定的、相对的概念啊！严肃在哪里结束，诙谐又从哪里开始呢？谦逊在哪里结束，不谦逊又从哪里开始呢？我们的命运不得不由书报检查官的脾气来决定。给书报检查官指定一种脾气和给作者指定一种风格一样，都是错误的。要是你们想在自己的美学批评中表现得彻底，你们就得禁止过分严肃和过分谦逊去去探讨真理，因为过分的严肃就是最大的滑稽，过分的谦逊就是最辛辣的讽刺。 最后，这是以对真理本身的完全歪曲的和缺角的观点为出发点的。作者的一切活动对象都被归结为“真理”这个一般观念。可是，同一个对象在不同的个人身上会获得不同的反映，并使自已的各个不同方面变成同样多的不同的精神性质；如果我们撇开一切主观的东西即上述情况不谈，难道对象的性质不应当对探讨发生一些哪怕是最微小的影响吗？不仅探讨的结果应当是合乎真理的，而且得出结果的途径也应当是合乎真理的。对真理的探讨本身应当是真实的，真实的探讨就是扩展了的真理，这种真理的各个分散环节在结果中是相互结合的。难道探讨的方式不应当随着对象而改变吗？当对象欢笑的时候，探讨却应当摆出严肃的样子；当对象令人讨厌的时候，探讨却应当是谦逊的。这样一来，你们就既损害了主体的权利，也损害了客体的权利。你们抽象地理解真理，把精神变成了枯燥地记录真理的裁判官。也许不必去为这些玄妙的玩意儿伤脑筋？对真理是否干脆就应该这样去理解，即凡是政府的命令都是真理，而探讨只不过是一种既多余又麻烦的、可是由于礼节关系又不能完全取消的第三者？看来情况差不多就是如此。因为探讨一开始就被认为是一种同真理对立的东西，因此，它就要在可疑的官方侍从——严肃和谦逊（当然俗人对牧师应该采取这种态度）的伴随下出现。政府的玏是国家的唯一理性；诚然，在一定的时势下，这种理智也必须向另一种理智及其空谈作某些让步，但是到那时，后一种理智就应当意识到：别人已向它让了步，而它西亚是无权的，因此，它应当表现得谦逊而又恭顺，严肃而又乏味的体裁却是独一无二的体裁，只要指出《莱茵省等级会议议论情况》就足以证明这一点。既然如此，为什么不干脆恢复那美好的旧式的德国公文体裁呢？请随意写吧，可是写出来的每一个字都必须同时是对自由的书报检查机关的阿谀奉承之词，而书报检查机关也就会让你们那既严肃又谦逊的言论顺利通过。可千万不要失去虔敬的意识啊！法律强调的并不是真理，而是谦逊和严肃。因此，一切——严肃，谦逊，首先是真理，都会引起怀疑，因为在这种真理的不确定的范围背后，看来还隐藏着一种非常确定、非常可疑的真理。检查令接着指出： “因此，论如何不应该按照某种心胸狭隘的、超出这一法律界限的意旨来实行书报检查。” “这一法律”首先指的就是 1819 年法令的第 2 条，可是检查令接着又援引了这个书报检查法令的总的“精神”。要把上面的两种规定结合起来是得容易的，因为书报检查法令的第2条就是该法令的精神的集中体现，而它的其余各条则是这种精神的更具体的划分和更详尽的规定。我们认为，对上述精神的以下几种表述最能说明这种精神的特征： 第 7 条：“科学院与各大学到目前为止所享有的免受书报检查的自由，在今后五年内将被取消。”第 10 款：“本临时决议自即日起生效，有效期五年，期满之前，联邦议会应切实研究通过体积办法才能够实施联邦条例第 18 条中提出的有关新闻出版自由的各项统一规定。随后就应该对德国境内新闻出版自由的合法界限**作出最后决定。” 有这样一种法律，哪里还存在新闻出版自由，它就取消这种自由，哪里应当实行新闻出版自由，它就通过书报检查使这种自由变成多余的东西——这样的法律不能认为是有利于新闻出版的。上述的第 10 款也干脆承认，暂时用书报检查法来代替联邦条例第18条中提出的、可能有一天要实行的新闻出版自由。这种quid pro quo［移花接木］[4]的做法至少表明，时势要求对新闻出版加以限制，法令就是由于不信任新闻出版界而产生的。为了替这种不得人心的做法辩解，甚至硬说这是一项有效期限只有五年的临时措施，可查，遗憾得很，它的有效期限竟达 22 年之久。 从检查令的下面一句话中我们就可以看出，检查令是如何陷于自相矛盾的，它一方面不允许按照超出法令界限的意旨来实行书报检查，但另一方面又规定书报检查应当超出这种界限：“当然，书报检查官也可以允许人们坦率地讨论国内事务。”书报检查官可以这样做，但不一定要这样做，因为这不是非做不可的。仅仅这种慎重的自由主义就已经非常肯定地不仅超出了书报检查法令的精神，而且也超出了它的特定要求。旧的书报检查法令，即在检查令中引用的第 2 条，不仅不准坦率地讨论普鲁士的事务，甚至也不准坦率地讨论中国的事务。检查令这样解释：“凡对任何国家中存在的图谋推翻国家制度的政党作赞许的叙述的一切企图，均属于这一范围”，即属于破坏普鲁士邦和德意志联邦 46 其他各邦的安全的范围。在这种情况下，难道还允许对中国或土耳其的国内事务进行坦率的讨论吗？既然如此遥远的情况都威胁着德意志联邦的脆弱的安全，那么每一句对内部事务表示不满的话又怎能不威胁它的安全呢？ 这样一来，检查令在自由主义方面就超出了书报检查法令第 2 条的精神（超出的内容以后就会清楚，不过，既然这种超出被说成是法令第 2 条的结论，那它在形式上就是值得怀疑的，其实检查令只明智地引用了法令第 2 条的前一半，但又责成书报检查官按照第 2 条条文本身办事），而在非自由主义方面，检查令也同样超出了书报检查法令的范围，它在对报刊的旧有的限制之外又加上了新的限制。 上述书报检查法令的第 2 条指出： “它的〈书报检查的〉目的是：与宗教的一般原则相违背的一切均应杜绝，不管个别宗教党派和国内允许存在的教派的见解和教义如何。” 1819 年，理性主义还占统治地位，这种理论把一般的宗教理解为所谓理性的宗教。这种理性主义的观点也就是书报检查法令的观点，可是这个法令太不彻底，它的目的是要保护宗教，但它的观点却是反宗教的。这种把宗教的一般原则同它的实际内容和规定性分割开来的做法，正是同宗教的一般原则相抵触的。因为每种宗教都认为，它同其他各种特殊的、虚构的宗教的区别，正在于它的特殊本质，正是由于它有这种规定性，它才是真正的宗教。新的书报检查令在它引用的第 2 条中省略了附加的限制条文，根据这一条文的规定，个别宗教党派和教派都不享有神圣不可侵犯的权利。不仅如此，检查令还作了如下的解释： “凡以轻佻的、敌对的方式反对一般的基督教或某一教理的行为，均不应容忍。” 旧的书报检查法令绝口不谈基督教，相反，它把宗教同所有个别的宗教党派和教派区别开来。新的书报检查令则不仅把宗教改成了基督教，而且还加上了某一教理几个字。这就是我们那种已经基督教化的科学的滑稽产物！新的书报检查令又给新闻出版造好了新的枷锁，谁还能否认这一点呢？据说，既不能一般地反对宗教，也不能特殊地反对宗教。或者，你们也许以为，“轻佻的、敌对的”这几个字眼已使新的锁链变成了玫瑰花环吧？轻佻、敌对，说得多么巧妙啊！“轻佻的”这个形容词是要求公民行为端庄正派，这是一个对众人公开的字眼，“敌对的”这个形容词则是对书报检查官偷偷地说的，它是“轻佻”在法律上的解释。在检查令中我们还能找到许多玩弄这种巧妙手法的例子：对公众用的是一套主观的、使人面红耳赤的字眼，对书报检查官用的则是另一套客观的、使作者不禁脸色发白的字眼。lettres de cachet［盖有封印的上谕］[5]简直也可以用这种手法谱成乐曲了。 书报检查令陷入了多么令人惊奇的矛盾！只有那种不彻底的攻击才是轻佻的，这种攻击只针对现象的个别方面，由于它本身不够深刻和严肃，因而不能涉及事物的本质；正是仅仅对特殊事物本身的攻击，才是轻佻的。因此，如果禁止对一般基督教的攻击，那么，只有对它的轻佻的攻击才是许可的了。相反，对宗教的一般原则，对宗教的本质，以及对特殊事物（就它是本质的表现而言）的攻击，都是敌对的。攻击宗教只能采取轻佻的或者敌对的方式，第三种方式是不存在的。当然，检查令的这种不彻底性只是一种假象，因为这种不彻底性的立足点就是这样一种假象而已。对于宗教，既不能用敌对的方式去攻击，也不能用轻佻的方式去攻击，既不能一般地去攻击，也不能特殊地去攻击，这就是说，根本不许攻击。 可是，如果同 1819 年的书报检查法令有明显矛盾的检查令要给哲学方面的书刊带上新的枷锁，那它至少应当表现得得彻底，能使宗教方面的书刊摆脱以前理性主义的法令加在它身上的旧枷锁。因为该法令曾宣布书报检查的目的也是“反对把宗教信条狂热地搬到政治中去，防止由此引起的概念混乱”。","path":"评普鲁士最近的书报检查令/","date":"09-16","excerpt":"","tags":[{"name":"中文马克思主义文库","slug":"中文马克思主义文库","permalink":"https://utgnim.github.io/sukebei/tags/%E4%B8%AD%E6%96%87%E9%A9%AC%E5%85%8B%E6%80%9D%E4%B8%BB%E4%B9%89%E6%96%87%E5%BA%93/"}]},{"title":"青年在选择职业时的考虑","text":"『卡·马克思的中学考试德语作文』 自然本身给动物规定了它应该遵守的活动范围，动物也就安分地在这个范围内活动，而不试图越出这个范围，甚至不考虑有其它满园存在。神也给人指定了共同的目标——使人类和他自己趋于高尚，但是，神要人自己去寻找可以达到这个目标的手段；神让人在社会上选择一个最适合于他、最能使他和社会变得高尚的地位。 这种选择是人比其它创造物远为优越的地方，但同时也是可能毁灭人的一生、破坏他的一切计划并使他陷于不幸的行为。因此，认真地权衡这种选择，无疑是开始走上生活道路而又不愿在最重要的事情上听天由命的青年的首要责任。 每个人眼前都有一个目标，这个目标至少在他本人看来是伟大的，而且如果最深刻的信念，即内心深处的声音，认为这个目标是伟大的，那它实际上也是伟大的，因为神决不会使世人完全没有引导者；神轻声地但坚定地作启示。 但是，这声音很容易被淹没；我们认为是热情的东西可能倏忽而生，同样可能倏忽而逝。也许，我们的幻想蓦然迸发，我们的感情激动起来，我们的眼前浮想联翩，我们狂热地追求我们以为是神本身给我们指出的目标；但是，我们梦寐以求的东西很快就使我们厌恶，于是，我们便感到自己的整个存在遭到了毁灭。 因此，我们应当认真考虑：我们对所选择的职业是不是真的怀有热情？发自我们内心的声音是不是同意选择这种职业？我们的热情是不是一种迷误？我们认为是神的召唤的东西是不是一种自我欺骗？不过，如果不对热情的来源本身加以探究，我们又怎么能认清这一切呢？ 伟大的东西是闪光的，闪光会激发虚荣心，虚荣心容易使人产生热情 或者一种我们觉得是热情的东西；但是，被名利迷住了心窍的人，理性是无法加以约束的，于是他一头栽达那不可抗拒的欲念召唤他去的地方；，他的职业已经不再是由他自己选择，而是由偶然机会和假象去决定了。 我们的使命决不是求得一个最足以炫耀的职业，因为它不是那种可能由我们长期从事，但始终不会使我们感到厌倦、始终不会使我们劲头低落、始终不会使我们的热情冷却的职业，相反，我们很快就会觉得，我们的愿望没有得到满足，我们的理想没有实现，我们就将怨天尤人。 但是，不仅虚荣心能够引起对某种职业的突然的热情，而且我们也许会用自己的幻想把这种职业美化，把它美化成生活所能提供的至高无上的东西。我们没有仔细分析它，没有衡量它的全部分量，即它加在我们肩上的重大责任；我们只是从远处观察它，而从远处观察是靠不住的。 在这里，我们自己的理性不能给我们充当顾问，因为当它被感情欺骗，受幻想蒙蔽时，它既不依靠经验，也不依靠更深入的观察。然而，我们的目光应该投向谁呢？当我们丧失理性的时候，谁来支持我们呢？ 是我们的父母，他们走过了漫长的生活道路，饱尝了人世辛酸。——我们的心这样提醒我们。 如果我们经过冷静的考察，认清了所选择的职业的全部分量，了解它的困难以后，仍然对它充满热情，仍然爱它，觉得自己适合于它，那时我们就可以选择它，那时我们既不会受热情的欺骗，也不会仓促从事。 但是，我们并不问题能够选择我们自认为适合的职业；我们在社会上的关系，还在我们有能力决定它们以前就已经在某种程度上开始确立了。 我们的体质常常威胁我们，可是任何人也不敢藐视它的权利。 诚然，我们能够超越体质的限制，但这么一来，我们也就垮得更快；在这种情况下，我们就是冒险把大厦建筑在残破的废墟上，我们的一生也就变成一场精神原则和肉体原则之间的不幸的斗争。但是，一个不能克服自身相互斗争的因素的人，又怎能抗御生活的猛烈冲击，怎能安静地从事活动呢？然而只有从安静中才能产生出伟大壮丽的事业，安静是唯一能生长出成熟果实的土壤。 尽管我们由于体质不适合我们的职业，不能持久地工作，而且很少能够愉快地工作，但是，为了克尽职守而牺牲自己幸福的思想激励着我们不顾体弱去努力工作。如果我们选择了力不胜任的职业，那么我们决不能把它做好，我们很快就会自愧无能，就会感到自己是无用的人，是不能完成自己使命的社会成员。由此产生的最自然的结果就是自卑。还有比这更痛苦的感情吗？还有比这更难于靠外界的各种赐予来补偿的感情吗？自卑是一条毒蛇，它无尽无休地搅扰、啃啮我们的胸膛，吮吸我们心中滋润生命的血液，流入厌世和绝望的毒液。 如果我们错误地估计了自己的能力，以为能够胜任经过较为仔细的考虑而选定的职业，那么这种错误将使我们受到惩罚。即便不受到外界的指责，我们也会感到比外界指责更为可怕的痛苦。 如果我们把这一切都考虑过了，如果我们的生活条件容许我们选择任何一种职业，那么我们就可以选择一种使我们获得最高尊严的职业，一种建立在我们深信其正确的思想上的职业，一种能给我们提供最广阔的场所来为人类工作，并使我们自己不断接近共同目标即臻于完美境界的职业，而对于这个共同目标来说，任何职业都只不过是一种手段。 尊严是最能使人高尚、使他的活动和他的一切努力具有更加崇高品质的东西，是使他无可非议、受到众人钦佩并高出于众人之上的东西。 但是，能给人以尊严的只有这样的职业，在从事这种职业时我们不是作为奴隶般的工具，而是在自己的领域内独立地进行创造；这种职业不需要有不体面的行动（哪怕只是表面上不体面的行动），甚至最优秀的人物也会怀着崇高的自豪感去从事它。最合乎这些要求的职业，并不总是最高的职业，但往往是最可取的职业。 但是，正如有失尊严的职业会𩨧我们一样，那种建立在我们后来认为是错误的思想上的职业也一定会成为我们的沉重负担。 这里，我们除了自我欺骗，别无解救办法，而让人自我欺骗的解救办法是多么令人失望啊！ 那些主要不是干预生活本身，而是从事抽象真理的研究的职业，对于还没有确立坚定的原则和牢固的、不可动摇信念的青年是最危险的，当然，如果这些职业在我们心里深深地扎下了根，如果我们能够为它们的主导思想而牺牲生命、竭尽全力，这些职业看来还是最高尚的。 这些职业能够使具有合适才干的人幸福，但是也会使那些不经考虑、凭一时冲动而贸然从事的人毁灭。 相反，重视作为我们职业的基础的思想，会使我们在社会上占有较高的地位，提高我们自己的尊严，使我们的行为不可动摇。 一个选择了自己所珍视的职业的人，一想到他可能不称职时就会战战兢兢——这种人单是因为他在社会上所处的地位是高尚的，他也就会使自己的行为保持高尚。 在选择职业是，我们应该遵守的主要指针是人类的幸福和我们自身的完美。不应认为，这两种利益会彼此敌对、互相冲突，一种利益必定消灭另一种利益；相反，人的本性是这样的：人只有为同时代人的完美、为他们的幸福而工作，自己才能达到完美。 如果一个人只为自己劳动，他也话能够成为著名的学者、伟大的哲人、卓越的诗人，然而他永远不能成为完美的、真正伟大的人物。 历史把那些为共同目标工作因而自己高尚的人称为最伟大的人物；经验赞美那些为大多数人带来幸福的人是最幸福的人；宗教本身也教诲我们，人人敬仰的典范，就曾为人类而牺牲自己——有谁敢否定这类教诲呢？ 如果我们选择了最能为人类而工作的职业，那么我们所享受的就不是可怜的、有限的、自私的乐趣，我们的幸福将属于千百万人，我们的事业将悄然无声地存在下去，但是它会永远发挥作用，而面对我们的骨灰，高尚的人们将洒下热泪。 卡·马克思写于 1835 年 8 月","path":"青年在选择职业时的考虑/","date":"09-14","excerpt":"","tags":[{"name":"中文马克思主义文库","slug":"中文马克思主义文库","permalink":"https://utgnim.github.io/sukebei/tags/%E4%B8%AD%E6%96%87%E9%A9%AC%E5%85%8B%E6%80%9D%E4%B8%BB%E4%B9%89%E6%96%87%E5%BA%93/"}]},{"title":"“古文观止”","text":"劝学荀子『先秦』 君子曰：学不可以已。 青，取之于蓝，而青于蓝；冰，水为之，而寒于水。木直中绳，𫐓以为轮，其曲中规。虽有槁暴，不利挺者，𫐓使之然也。故木受绳同时直，金就砺则利，君子博学而日参省乎己，则知明而行无过矣。 故不登高山，不知天之高也；不临深溪，不知地之厚也；不闻先王之遗言，不知学问之大也。干、越、夷、貉之子，生而同声，长而异俗，教使之然也。诗曰：“嗟尔君子，无恒安息。靖共尔位，好是正直。神之听之，介尔景福。”神莫大于化道，福莫长于无祸。 吾尝终日而思矣，不如须臾之所学也；吾尝跂而望矣，不如登高之博见也。登高而招，臂非加长也，而见者远；顺风而呼，声非加疾也，而闻者彰。假舆马者，非利足也，而致千里；假舟楫者，非能水也，而绝江河。君子生非异也，善假于物也。 南方有鸟焉，名曰蒙鸠，以羽为巢，而编之以发，系之苇苕，风至苕折，卵破子死。巢非不完也，所系者然也。西方有木焉，名曰射干，茎长四寸，生于高山之上，而临百仞之渊，木茎非能长也，所立者然也。蓬生麻中，不扶而直；白沙在涅，与之俱黑。兰槐之根是为芷，其渐之滫，君子不近，庶人不服。其质非不美也，所渐者然也。故君子居必择乡，游必就土，所以防邪辟而近中正也。 物类之起，必有所始。荣辱之来，必象其德。肉腐出虫，鱼枯生蠹。怠慢忘睡，祸灾乃作。强自取柱，柔自取束。邪秽在身，怨之所构。施薪若一，火就燥也，平地若一，水就湿也。草木畴生，禽兽君焉，物各从其类也。是故质的张，而弓矢至焉；林木茂，而斧斤至焉；树成荫，而众鸟息焉。醯酸，而蜹聚焉。故言有招祸也，行有招辱也，君子慎其所立乎！ 积土成山，风雨兴焉；积水成渊，蛟龙生焉；积善成德，而神明自得，圣心备焉。故不积跬步，无以至千里；不积小流，无以成江海。骐骥一跃，不能十步；驽马十驾，功在不舍。锲而舍之，朽木不折；锲而不舍，金石可镂。蚓无爪牙之利，筋骨之强，上食埃土，下饮黄泉，用心一也。蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。（江海 一作：江河） 是故无冥冥之志者，无昭昭之明；无惛惛之事者，无赫赫之功。行衢道者不至，事两君者不容。目不能两视而明，耳不能两听而聪。螣蛇无足而飞，鼫鼠五技而穷。《诗》曰：“尸鸠在桑，其子七兮。淑人君子，其仪一兮。其仪一兮，心如结兮！”故君子结于一也。 昔者瓠巴鼓瑟，而流鱼出听；伯雅鼓琴，而六马仰秣。故声无小而不闻，行无隐而不形。玉在山而草木润，渊生珠而崖不枯。为善不积邪？安有不闻者乎？ 学恶乎始？恶乎终？曰：其数则始乎诵经，终乎读礼；其义则始乎为士，终乎为圣人，真积力久则入，学至乎没而后止也。故学数有终，若其义则不可须臾舍也。为之，人也；舍之，禽兽也。故书者，政事之纪也；诗者，中声之所止也；礼者，法之大分，类之纲纪也；故；学至乎礼而止矣。夫是之谓道德之极。礼之敬文也，乐之中和也，诗书之博也，春秋之微也，在天地之间者毕矣。 君子之学也，入乎耳，箸乎心，布乎四体，形乎动静。端而言，蝡而动，一可以为法则。小人之学也，入乎耳，出乎口；口耳之间，则四寸耳，曷足以美七尺之躯哉！古之学者为己，今之学者为人。君子之学也，以美其身；小人之学也，以为禽犊。故不问而告谓之傲，问一而告二谓之囋。傲非也，囋非也；君子如向矣。 学莫便乎近其人。礼乐法而不说，诗书故而不切，春秋约而不速。方其人之习君子之说，则尊以遍矣，周于世矣。故曰：学莫便乎近其人。 学之经莫速乎好其人，隆礼次之。上不能好其人，下不能隆礼，安特将学杂识志，顺诗书而已耳。则末世穷年，不免为陋儒而已。将原先王，本仁义，则礼正其经纬蹊径也。若挈裘领，诎五指而顿之，顺者不可胜数也。不道礼宪，以诗书为之，譬之犹以指测河也，以戈春黍也，以锥餐壶也，不可以得之矣。故隆礼，虽未明，法士也；不隆礼，虽察辩，散儒也。 问楛者，勿告也；告楛者，勿问也；说楛者，勿听也。有争气者，勿与辩也。故必由其道至，然后接之；非其道则避之。故礼恭，而后可与言道之方；辞顺，而后感与言道之理；色从而后可与言道之致。故未可与言而言，谓之傲；可与言而不言，谓之隐；不观气色而言，谓瞽。故君子不傲、不隐、不瞽，谨顺其身。诗曰：“匪交匪舒，天子所予。”此之谓也。 百发失一，不足谓善射；千里蹞步一至，不足谓善御；伦类一通，仁义不一，不足谓善学。学也者，固学一之也。一出焉，一入焉，涂巷之人也；其善者少，不善者多，桀纣盗跖也；全之尽之，然后学者也。 君子知夫不全不粹之不足以为美也，故诵数以贯之，思索以通之，为其人以处之，除其害者以持养之。使目非是无欲见也，使耳非是无欲闻也，使口非是无欲言也，使心非是无欲虑也。及至其致好之也，目好之五色，耳好之五声，口好之五味，心利之有天下。是故权利不能倾也，群众不能移也，天下不能荡也，生乎由是，死乎由是，夫是之谓德操。德操然后能定，能定然后能应。能写能应，夫是之谓成人。天见其明，地见其光，君子贵其全也。","path":"“古文观止”/","date":"08-04","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 二十一","text":"邻仅老夫妇二人，灌园为业，知余夫妇避暑于此，先来通殷勤，并钓池鱼、摘园蔬为馈。偿其价，不受。芸作鞋报之，始谢而受。 时方七月，绿树阴浓，水面风来，蝉鸣聒耳。 邻老又为制鱼竿，与芸垂钓于柳阴深处。日落时，登土山，观晚霞夕照，随意联吟，有“兽云吞落日，弓月弹流星”之句。少焉，月印池中，虫声四起，设竹榻于篱下，老妪报酒温饭熟，遂就月光对酌，微醺而饭。浴罢，则凉鞋蕉扇，或坐或卧，听邻老谈因果报应事。三鼓归卧，周体清凉，几不知身居城市矣。 篱边倩邻老购菊，遍植之。九月花开，又与芸居十日。吾母亦欣然来观，持螯对菊，赏玩竟日。 芸喜曰：“他年当与君卜筑于此，买绕屋菜园十亩，课仆妪，植瓜蔬，以供薪水。君画我绣，以为诗酒之需。布衣菜饭，可乐终身，不必作远游计也。” 余深然之。今即得有境地，而知己沦亡，可胜浩叹！","path":"浮生六记-卷一-闺房记乐-二十一/","date":"07-30","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 二十","text":"迁仓米巷，余颜其卧楼曰“宾香阁”，盖以芸名而取“如宾”之意也。 院窄墙高，一无可取。后有厢楼，通藏书处，开窗以陆氏废园，但有荒凉之象。沧浪风景，时切芸怀。 有老妪居金母桥之东，埂巷之北。绕屋皆菜圃，编篱为门，门外有池，约亩许，花光树影，错杂篱边。其地即元末张士诚王府废基也。屋西数武，瓦砾堆土成山，登其巅可远眺。地旷人稀，颇饶野趣。 妪偶言及，芸神往不置，谓余曰：“自别沧浪，梦魂常绕，今不得已而思其次，其老妪之居乎？” 余曰：“连朝秋暑灼人，正思得一清凉地以消长昼。卿若愿往，我先观其家，可居，即襆被而往，作一月盘桓，何如？” 芸曰：“恐堂上不许。” 余曰：“我自请之。” 越日，至其地，屋仅二间，前后隔而为四，纸窗竹榻，颇有幽趣。老妪知其意，欣然出其卧室为赁，四壁糊以白纸，顿觉改观。于是禀知吾母，挈芸居焉。","path":"浮生六记-卷一-闺房记乐-二十/","date":"07-30","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾玖","text":"其癖好与余同，且能察眼意，懂眉语，一举一动，示之以色，无不头头是道。 余尝曰：“惜卿雌而伏，苟能化女为男，相与访名山，搜胜迹，遨游天下，不亦快哉！” 芸曰：“此何难，俟妾鬓斑之后，虽不能远游五岳，而近地之虎阜、灵岩，南至西湖，北至平山，尽可偕游。” 余曰：“恐卿鬓斑之日，步履已艰。” 芸曰：“今世不能，期以来世。” 余曰：“来世卿当作男，我为女子相从。” 芸曰：“必得不昧今生，方觉其有情趣。” 余笑曰：“幼时一粥，犹谈不了，若来世不昧今生，合卺之夕，细谈隔世，更无合眼时矣。” 芸曰：“世传月下老人专司人间婚姻事，今生夫妇已承牵合，来世婚姻亦须仰籍神力，盍绘一像祀之？” 时有苕溪戚柳堤，名遵善写人物。倩绘一像：一手挽红丝，一手携杖，悬姻缘簿，童颜鹤发，奔驰于非烟非雾中。此戚君得意笔也。友人石琢堂为题赞语于首。悬之内室。 每逢朔望，余夫妇必焚香拜祷。后因家庭多故，此画竟失所在，不知落在谁家矣。 “他生未卜此生休”，两人痴情，果邀神鉴耶？","path":"浮生六记-卷一-闺房记乐-拾玖/","date":"07-29","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾捌","text":"余启堂弟妇，王虚舟先生孙女也。催妆时偶缺珠花，芸出其纳采所受者呈吾母，婢妪旁惜之。 芸曰：“凡为妇人，已属纯阴，珠乃纯阴之精，用为首饰，阳气全克矣，何贵焉？” 而于破书残画，反极珍惜。书之残缺不全者，必搜集分门，汇订成帙，统名之曰：“断简残编”；字画之破损者，必觅故纸，粘补成幅，有破缺处，倩予全好而卷之，名曰“弃余集赏”。于女红中馈之暇，终日琐琐，不惮烦倦。 芸于破笥烂卷中，偶获片纸可观者，如得异宝。旧邻冯妪每收乱卷卖之。","path":"浮生六记-卷一-闺房记乐-拾捌/","date":"07-29","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾柒","text":"芸初缄默，喜听余议论。余调其言，如蟋蟀之用纤草，渐能发议。 其每日饭必用茶泡，喜用茶泡食芥卤乳腐，吴俗呼为“臭乳腐”，又喜食虾卤瓜。此二物余生平所最恶者，因戏之曰：“狗无胃而食粪，以其不知臭秽；蜣螂团粪而化蝉，以其欲修高举也。卿其狗耶？蝉耶？” 芸曰：“腐取其价廉而可粥可饭，幼时食惯。今至君家，已如蜣螂化蝉，犹喜食之者，不忘本也。至卤瓜之味，到此初尝耳。” 余曰：“然则我家系狗窦耶？” 芸窘而强解曰：“夫粪，人家皆有之，要在食与不食之别耳。然君喜食蒜，妾亦强啖之。腐不敢强，瓜可掩鼻略尝，入咽当知其美，此犹无盐貌丑而德美也。” 余笑曰：“卿陷我作狗耶？” 芸曰：“妾作狗久矣，屈君试尝之。” 以箸强塞余口。余掩鼻咀嚼之，似觉脆美，开鼻再嚼，竟成异味，从此亦喜食。 芸以麻油加白糖少许拌卤腐，亦鲜美。以卤瓜捣烂拌卤腐，名之曰“双鲜酱”，有异味。 余曰：“始恶而终好之，理之不可解也。” 芸曰：“情之所钟，虽丑不嫌。”","path":"浮生六记-卷一-闺房记乐-拾柒/","date":"07-28","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾六","text":"余堂伯父素存公早亡，无后，吾父以余嗣焉。墓在西跨塘福寿山祖茔之侧，每年春日，必挈芸拜扫。王二姑闻其地有戈园之胜，请同往。 芸见地下小乱石有苔纹，斑驳可观，指示余日：“以此叠盆山，较宣州白石为古致。” 余曰：“若此者，恐难多得。” 王曰：“嫂果爱此，我为拾之。” 即向守坟者麻袋一，鹤步而拾之。每得一块，余曰“善”，即收之；余曰“否”，即去之。未几，粉汗盈盈，拽袋返曰：“再拾则力不胜矣。” 芸且拣且言曰：“我闻山果收获，必代猴力，果然。” 王愤撮十指作哈痒状，余横阻之，责芸曰：“人劳汝逸，犹作此语，无怪妹之动愤也。” 归途游戈园，稚绿娇红，争妍竞媚。王素憨，逢花必折。芸叱曰：“既无瓶养，又不簪戴，多折何为？” 王曰：“不知痛痒者，何害？” 余笑曰：“将来罚嫁麻面多须郎，为花泄忿。” 王恕余以目，掷花于地，以莲钩拨入池中，曰：“何欺侮我之甚也！” 芸笑解之而罢。","path":"浮生六记-卷一-闺房记乐-拾六/","date":"07-19","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾五","text":"吾父稼夫公喜认义子，以故余异姓弟兄有二十六人。吾母亦有义女九人，九人中王二姑、俞六姑与芸最和好。王痴憨善饮，俞豪爽善谈。每集必逐余居外，而得三女同榻，此俞六姑一人计也。 余笑曰：“俟妹于归后，我当邀妹丈来，一住必十日。” 俞曰：“我亦来此，与嫂同榻，不大妙耶？” 芸与王微笑而已。 时为吾北启堂娶妇，迁居饮马桥之仓米巷。屋虽宏畅，非复沧浪亭之幽雅矣。吾母诞辰演剧，芸初以为奇观。吾父素无忌讳，点演《惨别》等剧，老伶刻画，见者情动。 余窥帘，见芸忽起去，良久不出，入内探之，俞与王亦继至。见芸一人支颐独坐镜奁之侧，余曰：“何不快乃尔？”芸曰：“观剧原以陶情，今日之戏徒令人断肠耳。”俞与王皆笑之。余曰：“此深于情者也。”俞曰：“嫂将竟日独坐于此耶？”芸曰：“俟有可观者再往耳。” 王闻言先出，请吾母点《刺梁》《后索》等剧，劝芸出观，始称快。","path":"浮生六记-卷一-闺房记乐-拾五/","date":"07-19","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾四","text":"中秋日，余病初愈。以芸半年新妇，未尝一至间壁之沧浪亭，先令老仆约守者，勿放闲人。于将晚时，偕芸及余幼妹，一妪一婢扶焉，老仆前导，过石桥，进门折东，曲径而入。叠石成山，林木葱翠，亭在土山之巅。循级至亭心，周望极目可数里。炊烟四起，晚霞灿然。隔岸名“近山林”，为大宪行台宴集之地，时正谊书院犹未启也。 携一毯设亭中，席地环坐，守者烹茶以进。少焉，一轮明月已上林梢，渐觉风生袖底，月到波心，俗虑尘怀，爽然顿释。芸曰：“今日之游乐矣！若驾一叶扁舟，往来亭下，不更快哉！” 吴俗，妇女是晚不拘大家小户皆出，结队而游，名曰“走月亮”。沧浪亭幽雅清旷，反无一人至者。","path":"浮生六记-卷一-闺房记乐-拾四/","date":"07-19","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾三","text":"七月望，俗谓之鬼节。芸备小酌，拟邀月畅饮。 夜忽阴云如晦，芸愀然曰：“妾能与君白头偕老，月轮当出。”余亦索然。但见隔岸萤光，明灭万点，梳织于柳堤蓼渚间。 余与芸联句以遣闷怀，而两韵之后，逾联逾纵，想入非夷，随口乱道。芸已漱涎涕泪，笑倒余怀，不能成声矣。觉其鬓边茉莉浓香扑鼻，因拍其背，以他词解之曰：“想古人以茉莉形色如珠，故供助妆压鬓，不知此花必沾油头粉面之气，其香更可爱，所以供佛手，当退三舍矣。” 芸乃止笑曰：“佛手乃香中君子，只在有意无意间；茉莉是香中小人，故须借人之势，其香也如胁肩谄笑。”余曰：“卿何远君子而近小人？”芸曰：“我笑君子爱小人耳。” 正话间，漏已三滴，渐见风扫云开，一轮涌出，乃大喜，倚窗对酌。酒未三杯，忽闻桥下哄然一声，如有人堕。就窗细瞩，波明如镜，不见一物，惟闻河滩有只鸭急奔声。余知沧浪亭畔素有溺鬼，恐芸胆怯，未敢即言。 芸曰：“噫！此声也，胡为乎来哉？” 不禁毛骨皆栗。急闭窗，携酒归房。一灯如豆，罗帐低垂，弓影杯蛇，惊神未定。剔灯入帐，芸已寒热大作。余亦继之，困顿两旬。 真所谓乐极灾生，亦是白头不终之兆。","path":"浮生六记-卷一-闺房记乐-拾三/","date":"07-18","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾二","text":"是年七夕，芸设香烛瓜果，同拜天孙于“我取轩”。 余镌“愿生生世世为夫妇”图章二方，余执朱文，芸执白文，以为往来书信之用。是夜，月色颇佳。俯视河中，波光如练。轻罗小扇，并坐水窗，仰见飞云过天，变态万状。 芸曰：“宇宙之大，同此一月，不知今日世间，亦有如两人之情兴否？” 余曰：“纳凉玩月，到处有之。若品论云霞，或求之幽闺绣闼，慧心默证者，固亦不少。若夫妇同观，所品论者，恐不在此云霞耳。” 未几，烛烬月沉，撤果归卧。","path":"浮生六记-卷一-闺房记乐-拾二/","date":"07-18","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾一","text":"余性爽直，落拓不羁。芸若腐儒，迂拘多礼。 偶为披衣整袖，必连声道“得罪”‘或递巾授扇，必起身来接。余始厌之，曰：“卿欲以礼缚我耶？语曰：‘礼多必诈’。” 芸两颊发赤，曰：“恭而有礼，何反言诈？” 余曰：“恭敬在心，不在虚文。” 芸曰：“至亲莫如父母，可内敬在心而外肆狂放耶？” 余曰：“前戏言之耳。” 芸曰：“世间反目多由戏起，后勿冤妾，令人郁死！” 余乃挽之入怀， 抚慰之，始解颜为笑。自此“岂敢”、“得罪”竟成语助词矣。 鸿案相庄廿有三年，年愈久而情愈密。家庭之内，或暗室相逢，窄途邂逅，必握手问曰：“何处去？”私心忒忒，如恐旁人见之者。实则同行并坐，初犹避人，久则不以为意。 芸或与人坐谈，见余至，必起立偏挪其身，余就而并焉。彼此皆不觉其所以然者，始以为惭，继成不期然而然。 独怪老年夫妇相视如仇者，不知何意？或曰：“非如是，焉得白头偕老哉！” 斯言诚然欤？","path":"浮生六记-卷一-闺房记乐-拾一/","date":"07-18","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"新概念英语 - 第 1 册","text":"Excuse meExcuse me!Yes?Is this your handbag?Pardon?Is this your handbag?Yes, it is.Thank you very much. Sorry sirMy coat and my umbrella please.Here is my tickets.Thank you, sir.Number five.Here’s your umbrella and your coat.This is not my umbrella.Sorry sir.Is this your umbrella?No, it isn’t.Is this it?Yes, it is.Thank you very much. Nice to meet youGood morning.Good morning, Mr. Blake.This is Miss Sophie Dupont.Sophie is a new student. She is French.Sophie, this is Hans. He is German.Nice to meet you.And this is Naoko. She’s Japanese.Nice to meet you.And this is Chang-woo. He’s Korean.Nice to meet you.And this is Luming. He is Chinese.Nice to meet you.And this is Xiaohui. Shie’s Chinese, too.Nice to meet you. Are you a teacherI am a new student. My name’s Robert.Nice to meet you. My name’s Sophie.Are you French?Yes, I am.Are you French too?No, I am not.What nationality are you?I’m Italian.Are you a teacher?No, I’m not.What’s your job?I’m a keyboard operator.What’s your job?I’m an engineer. How are you todayHello, Helen.Hi, Steven.How are you today?I’m very well, thank you. And you?How is Tony?He’s fine, thanks. How’s Emma?She’s very well, too, Helen.Goodbye, Helen. Nice to see you.Nice to see you, too, Steven.Goodbye. Is this your shirtWhose shirt is that?Is this your shirt, Dave?No. Sir. It’s not my shirt.This is my shirt. My shirt’s blue.Is this shirt Tim’s?Perhaps it is, sir. Tim’s shirt’s white.Tim!Yes, sir?Is this your shirt?Yes, sir.Here you are. Catch!Thank you. sir. A New DressWhat color’s your new dress?It’s green.Come upstairs and see it.Thank you.Look! Here it is!That’s a nice dress. It’s very smart.My hat’s new, too.What colour is it?It’s the same colour. It’s green, too.That is a lovely hat! You passports pleaseAre you Swedish?No, we are not. We are Danish.Are your friends Danish, too?No, they aren’t. They are Norwegian.Your passports, please.Here they are.Are these your cases?No, they aren’t.Our cases are brown. Here they are.Are you tourists?Yes, we are.Are your friends tourists too?Yes, they are.That’s fine.Thank you very much. How do you doCome and meet our employees, Mr. Richards.Thank you, Mr, Jackson.This is Nicola Grey, and this is Claire Taylor.How do you do?Those women are very hard-working.What are their jobs?They’re keyboard operators.This is Michael Baker, and this is Jeremy Short.How do you do?They aren’t very busy!What are their jobs?They’re sales reps.They are very lazy.Who is this young man?This is Jim.He is our office assistant. Tired and thirstyWhat’s the matter, children?We are tired and thirsty, Mum.Sit down here.Are you all right now?No, we aren’t.Look!There’s an ice cream man.Two ice cream please.Here you are, children.Thanks, Mum.These ice creams are nice.Are you all right now?Yes, we are, thank you. Which bookGive me a book please, Jane.Which book?This one?No, not that one. The red one.This one?Yes, please.Here you are.Thank you. Which glassesGive me some glasses please, Jane.which glasses?These glasses?No, not these. The ones on the shelf.These?Yes, please.Here you are.Thanks. Mrs Smith’s kitchenMrs. Smith’s kitchen is small.There is a refrigerator in the kitchen.The refrigerator is white.It is on the right.There is an electric cooker in the kitchen.The cooker is blue.It is on the left.There is a table in the middle of the room.There is a bottle on the table.The bottle is empty.There is a cup on the table, too.The cup is clean.","path":"新概念英语-第-1-册/","date":"07-15","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 拾","text":"一日，芸问曰：“各种古文，宗何为是？” 余曰：“《国策》、《南华》取其灵快，匡衡、刘向取其雅健，史迁、班固取其博大，昌黎取其浑，柳州取其峭，庐陵取其宕，三苏取其辩，他若贾、董策对，庾、徐骈体，陆贽奏议，取资者不能尽举，在人之慧心领会耳。” 芸曰：“古文全在识高气雄，女子学之恐难入彀，唯诗之一道，妾稍有领悟耳。” 余曰：“唐以诗取士，而诗之宗匠必推李、杜，卿爱宗何人？” 芸发议曰：“杜诗锤炼精纯，李诗潇洒落拓。与其学杜之森严，不如学李之活泼。” 余曰：“工部为诗家之大成，学者多宗之，卿独取李，何也？” 芸曰：“格律谨严，词旨老当，诚杜所独擅。但李诗宛如姑射仙子，有一种落花流水之趣，令人可爱。非杜亚于李，不过妾之私心宗杜心浅，爱李心深。” 余笑曰：“初不料陈淑珍乃李青莲知己。” 芸笑曰：“妾尚有启蒙白乐天先生，时感于怀，未尝稍释。” 余曰：“何谓也？” 芸曰：“彼非作《琵琶行》者耶？” 余笑曰：“异哉！李太白是知己，白乐天是启蒙师，余适字‘三白’，为卿婿，卿与‘白’字何其有缘耶？” 芸笑曰：“白字有缘，将来恐白字连篇耳。”吴音呼别字为白字。 相与大笑。 余曰：“卿既知诗，亦当知赋之弃取。” 芸曰：“《楚辞》为赋之祖，妾学浅费解。就汉、晋人中调高语炼，似觉相如为最。” 余戏曰：“当日文君之从长卿，或不在琴而在此乎？” 复相与大笑而罢。","path":"浮生六记-卷一-闺房记乐-拾/","date":"07-15","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 玖","text":"时当六月，内室炎蒸，幸居沧浪亭爱莲居西间壁。 板桥内一轩临流，名曰“我取”，取“清斯濯缨，浊斯濯足”意也。檐前老树一株，浓阴覆窗，人面俱绿，隔岸游人往来不绝。 此吾父稼夫公垂帘宴客处也。 禀命吾母，携芸消夏于此。因暑罢绣，终日伴余课书论古、品月评花而已。芸不善饮，强之可三杯，教以射覆为令。自以为人间之乐，无过于此矣。","path":"浮生六记-卷一-闺房记乐-玖/","date":"07-15","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 捌","text":"而欢娱易过，转睫弥月。 时吾父稼夫公在会稽幕府，专役相迓，受业于武林赵省斋先生门下。先生循循善诱，余今日之尚能握管，先生力也。 归来完姻时，原订随侍到馆；闻信之余，心甚怅然。恐芸之对人堕泪，而芸反强颜劝勉，代整行装，是晚，但觉神色稍异而已。 临行，向余小语曰：“无人调护，自去经心。”及登舟解缆，正当桃李争妍之候，而余则恍同林鸟失群，天地异色，到馆后，吾父即渡江东去。 居三月，如十年之隔。芸虽时有书来，必两问一答，半多勉励词，余皆浮套语，心殊怏怏。每当风生竹院，月上蕉窗，对景怀人，梦魂颠倒。先生知其情，即致书吾父，出十题而遣余暂归，喜同戍人得赦。 登舟后，反觉一刻如年。及抵家，吾母处问安毕，入房，芸起相迎，握手未通片语，而两人魂魄恍恍然化烟成雾，觉耳中惺然一响，不知更有此身矣。","path":"浮生六记-卷一-闺房记乐-捌/","date":"07-15","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 柒","text":"芸作新妇，初甚缄默，终日无怒容，与之言，微笑而已。事上以敬，处下以和，井井然未尝稍失。每见朝暾上窗，即披衣急起，如有人呼促者然。 余笑曰：“今非吃粥比矣，何尚畏人嘲耶？” 芸曰：“曩之藏粥待君，传为话柄。今非畏嘲，恐堂上道新娘懒惰耳。” 余虽恋其卧而德其正，因亦随之早起。自此耳鬓相磨，亲同形影，爱恋之情有不可以言语形容者。","path":"浮生六记-卷一-闺房记乐-柒/","date":"07-14","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 陆","text":"是日，亲朋络绎，上灯后始作乐。 廿四子正，余作新舅送嫁，丑末归来，业已灯残人静。悄然入室，伴妪盹于床下，芸卸妆尚未卧，高烧银烛，低垂粉颈，不知观何书而出神若此。 因抚其肩曰：“姊连日辛苦，何犹孜孜不倦耶？” 芸忙回首起立曰：“顷正欲卧，开橱得此书，不觉阅之忘倦。《西厢》之名闻之熟矣，今始得见，真不愧才子之名，但未免形容尖薄耳。” 余笑曰：“唯其才子，笔墨方能尖薄。” 伴妪在旁促卧，令其闭门先去。遂与比肩调笑，恍同密友重逢。戏探其怀，亦怦怦作跳，因俯其耳曰：“姊何心舂乃尔耶？” 芸回眸微笑，便觉一缕情丝摇人魂魄。拥之入帐，不知东方之既白。","path":"浮生六记-卷一-闺房记乐-陆/","date":"07-14","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 洞房花烛","text":"至乾隆庚子正月二十二日，花烛之夕，见瘦怯身材依然如昔。头巾既揭，相视嫣然。 合卺后，并肩夜膳，余暗于案下握其腕，暖尖滑腻，胸中不觉怦怦作跳。让之食，适逢斋期，已数年矣。暗计吃斋之初，正余出痘之期，因笑谓曰：“今我光鲜无恙，姊可从此开戒否？”芸笑之以目，点之以首。 廿四日余姊于归，廿三国忌不能作乐，故廿二之夜即为余姊款嫁，芸出堂陪宴。余在洞房与伴娘对酌，拇战辄北，大醉而卧。醒则芸正晓妆未竟也。","path":"浮生六记-卷一-闺房记乐-洞房花烛/","date":"07-14","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"搭建 Hexo 静态博客参考资料","text":"Hexo 官方文档 https://hexo.io/zh-cn/docs/ Hexo 主题 ​maupassant-hexo maupassant-hexo 中文文档 gal-theme Hexo 双主题教程 Hexo 中同时使用多个主题 主要参考了这个； Hexo 的多主题自动化部署 这个只能看懂一部分，我果然还是太菜了！ Markdown 教程 菜鸟教程 - Markdown 教程","path":"搭建-Hexo-静态博客参考资料/","date":"07-13","excerpt":"","tags":[{"name":"技术","slug":"技术","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"浮生六记 - 卷一 闺房记乐 肆","text":"是夜送亲城外，返已漏三下。腹饥索饵，婢妪以枣脯进，余嫌其甜。芸暗牵余袖，随至其室，见藏有暖粥并小菜焉。 余欣然举箸，忽闻芸堂兄玉衡呼曰：“淑妹速来！” 芸急闭门曰：“已疲乏，将卧矣。” 玉衡挤身而入，见余将吃粥，乃笑睨芸曰：“顷我索粥，汝曰‘尽矣’，乃藏此专待汝婿耶？”芸大窘避去，上下哗笑之。余亦负气，挈老仆先归。 自吃粥被嘲，再往，芸即避匿，余知其恐贻人笑也。","path":"浮生六记-卷一-闺房记乐-肆/","date":"07-12","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"『转载』大道至简 —— Hexo 简洁主题推荐","text":"本文转载自 大道至简——Hexo简洁主题推荐，未经作者授权。 『注：本文更新于2022年1月27日』 Maupassant最初是由Cho大神为Typecho平台设计开发的一套响应式模板，体积只有20KB，在各种尺寸的设备上表现出色。由于其简洁大气的风格受到许多用户喜爱，目前也已经被移植到了多个平台上，例如： Typecho：https://github.com/pagecho/maupassant/ Octopress：https://github.com/pagecho/mewpassant/ Farbox：https://github.com/pagecho/Maupassant-farbox/ Hugo：https://github.com/rujews/maupassant-hugo/ 我在一年多以前使用Typecho博客程序的时候就用过这套主题（历史文章），后来更换至Hexo后不得不暂时放弃它，直到几个月前发现了由icylogic移植到Hexo的版本，喜出望外，立刻回归到Maupassant。 不过由icylogic最初移植的版本只保留了主题最基本的模块，跟Cho自己发布的Farbox版类似，无法满足大部分爱折腾的Hexoer的需要。因此，在这半年的使用过程中，我将icylogic的源码fork过来，陆陆续续添加了一些想要的功能，目前能够实现的功能已经跟当初Typecho平台上的版本差不多了。 我已经将修改后的代码发布在Github上，有兴趣的朋友可以下载试用，并欢迎反馈问题： 主题安装安装主题和渲染器： 123$ git clone https://github.com/tufu9441/maupassant-hexo.git themes/maupassant $ npm install hexo-renderer-pug --save $ npm install hexo-renderer-sass --save 编辑Hexo目录下的 _config.yml，将theme的值改为maupassant。 注：依赖hexo-renderer-sass安装时容易报错，很可能是国内网络问题，请尝试使用代理或者切换至NPM的国内镜像源安装。 功能配置默认配置: 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142disqus: enable: false ## If you want to use Disqus comment system, please set the value to true. shortname: ## Your disqus_shortname, e.g. username api: ## You can visit Disqus comments in China mainland without barriers using Disqus API, e.g. https://disqus.skk.moe/disqus/ apikey: ## Your API key obtained in Disqus API Application, e.g. yk00ZB1fjYGRkrCrDDRYDUjpp26GJWJiJRZQZ5SY0r3th5FMW6pnSzQMnWH7ua7r admin: ## Username of your Disqus moderator, e.g. username admin_label: ## The text of Disqus moderator badge, e.g. Moduyan: ## Your uyan_id. e.g. 1234567livere: ## Your livere data-uid, e.g. MTAyMC8zMDAxOC78NTgzchangyan: ## Your changyan appid, e.g. cyrALsXc8changyan_conf: ## Your changyan conf, e.g. prod_d8a508c2825ab57eeb43e7c69bba0e8bgitalk: ## See: https://github.com/gitalk/gitalk enable: false ## If you want to use Gitment comment system please set the value to true. owner: ## Your GitHub ID, e.g. username repo: ## The repository to store your comments, make sure you&#x27;re the repo&#x27;s owner, e.g. gitalk.github.io client_id: ## GitHub client ID, e.g. 75752dafe7907a897619 client_secret: ## GitHub client secret, e.g. ec2fb9054972c891289640354993b662f4cccc50 admin: ## Github repo owner and collaborators, only these guys can initialize github issues.valine: ## See: https://valine.js.org enable: false ## If you want to use Valine comment system, please set the value to true. appid: ## Your LeanCloud application App ID, e.g. pRBBL2JR4N7kLEGojrF0MsSs-gzGzoHsz appkey: ## Your LeanCloud application App Key, e.g. tjczHpDfhjYDSYddzymYK1JJ notify: false ## Mail notifier, see https://github.com/xCss/Valine/wiki/Valine-评论系统中的邮件提醒设置 verify: false ## Validation code. placeholder: Just so so ## Comment box placeholders. avatar: &quot;mm&quot; ## Gravatar type, see https://github.com/xCss/Valine/wiki/avatar-setting-for-valine pageSize: 10 ## Number of comments per page. guest_info: nick,mail,link ## Attributes of reviewers.minivaline: ## See: https://github.com/MiniValine/MiniValine enable: false ## If you want to use MiniValine comment system, please set the value to true. appId: ## Your LeanCloud application App ID, e.g. pRBBL2JR4N7kLEGojrF0MsSs-gzGzoHsz appKey: ## Your LeanCloud application App Key, e.g. tjczHpDfhjYDSYddzymYK1JJ placeholder: Write a Comment ## Comment box placeholder. adminEmailMd5: ## The MD5 of Admin Email to show Admin Flag. math: true ## Support MathJax. md: true ## Support Markdown. # MiniValine&#x27;s display language depends on user&#x27;s browser or system environment # If you want everyone visiting your site to see a uniform language, you can set a force language value # Available values: en | zh-CN | (and many more) # More i18n info: https://github.com/MiniValine/minivaline-i18n lang:waline: ## See: https://waline.js.org/ enable: false ## If you want to use Waline comment system, please set the value to true. serverURL: ## Your server url, e.g. https://your-domain.vercel.app pageSize: ## The desired number of comments shown in each page.utterances: ## See: https://utteranc.es enable: false ## If you want to use Utterances comment system, please set the value to true. repo: ## The repository utterances will connect to, e.g. tufu9441/comments identifier: title ## The mapping between blog posts and GitHub issues. theme: github-light ## Choose an Utterances theme which matches your blog.twikoo: ## See: https://twikoo.js.org enable: false ## If you want to use twikoo comment system, please set the value to true. envId: ## Tencent CloudBase envId region: ## Tencent CloudBase region, e.g. ap-shanghai path: ## Article path, e.g. window.location.pathnamegoogle_search: true ## Use Google search, true/false.baidu_search: false ## Use Baidu search, true/false.swiftype: ## Your swiftype_key, e.g. m7b11ZrsT8Me7gzApciTself_search: false ## Use a jQuery-based local search engine, true/false.google_analytics: ## Your Google Analytics tracking id, e.g. UA-42425684-2baidu_analytics: ## Your Baidu Analytics tracking id, e.g. 8006843039519956000fancybox: true ## If you want to use fancybox please set the value to true.show_category_count: false ## If you want to show the count of categories in the sidebar widget please set the value to true.toc_number: true ## If you want to add list number to toc please set the value to true.shareto: false ## If you want to use the share button please set the value to true, and you must have hexo-helper-qrcode installed.busuanzi: false ## If you want to use Busuanzi page views please set the value to true.wordcount: false ## If you want to display the word counter and the reading time expected to spend of each post please set the value to true, and you must have hexo-wordcount installed.widgets_on_small_screens: false ## Set to true to enable widgets on small screens.canvas_nest: enable: false ## If you want to use dynamic background please set the value to true, you can also fill the following parameters to customize the dynamic effect, or just leave them blank to keep the default effect. color: ## RGB value of the color, e.g. &quot;100,99,98&quot; opacity: ## Transparency of lines, e.g. &quot;0.7&quot; zIndex: ## The z-index property of the background, e.g. &quot;-1&quot; count: ## Quantity of lines, e.g. &quot;150&quot;donate: enable: false ## If you want to display the donate button after each post, please set the value to true and fill the following items on your need. You can also enable donate button in a page by adding a &quot;donate: true&quot; item to the front-matter. github: ## GitHub URL, e.g. https://github.com/Kaiyuan/donate-page alipay_qr: ## Path of Alipay QRcode image, e.g. /img/AliPayQR.png wechat_qr: ## Path of Wechat QRcode image, e.g. /img/WeChatQR.png btc_qr: ## Path of Bitcoin QRcode image, e.g. /img/BTCQR.png btc_key: ## Bitcoin key, e.g. 1KuK5eK2BLsqpsFVXXSBG5wbSAwZVadt6L paypal_url: ## Paypal URL, e.g. https://www.paypal.me/tufu9441post_copyright: enable: false ## If you want to display the copyright info after each post, please set the value to true and fill the following items on your need. author: ## Your author name, e.g. tufu9441 copyright_text: ## Your copyright text, e.g. The author owns the copyright, please indicate the source reproduced.love: false ## If you want the peach heart to appear when you click anywhere, set the value to true.plantuml: ## Using PlantUML to generate UML diagram, must install hexo-filter-plantuml (https://github.com/miao1007/hexo-filter-plantuml). render: &quot;PlantUMLServer&quot; ## Local or PlantUMLServer. outputFormat: &quot;svg&quot; ## common options: svg/pngcopycode: true ## If you want to enable one-click copy of the code blocks, set the value to true.dark: false ## If you want to toggle between light/dark themes, set the value to true.totop: true ## If you want to use the rocketship button to return to the top, set the value to true.external_css: false ## If you want to load an external CSS file, set the value to true and create a file named &quot;external.css&quot; in the source/css folder.menu: - page: home directory: . icon: fa-home - page: archive directory: archives/ icon: fa-archive - page: about directory: about/ icon: fa-user - page: rss directory: atom.xml icon: fa-rsswidgets: ## Six widgets in sidebar provided: search, category, tag, recent_posts, recent_comments and links. - search - category - tag - recent_posts - recent_comments - linkslinks: - title: site-name1 url: http://www.example1.com/ - title: site-name2 url: http://www.example2.com/ - title: site-name3 url: http://www.example3.com/timeline: - num: 1 word: 2014/06/12-Start - num: 2 word: 2014/11/29-XXX - num: 3 word: 2015/02/18-DDD - num: 4 word: More# Static filesjs: jscss: css# Theme versionversion: 1.0.0 disqus - Disqus评论系统，支持DisqusJS API uyan - 友言评论系统 livere - 来必力评论系统 changyan - 畅言评论系统 gitment - Gitment评论系统相关参数 gitalk - Gitalk评论系统相关参数 valine - Valine评论系统相关参数 minivaline - MiniValine评论系统相关参数 waline - Waline评论系统相关参数 utterances - Utterances评论系统相关参数 google_search - 默认使用Google搜索引擎 baidu_search - 若想使用百度搜索，将其设定为true。 swiftype - Swiftype 站内搜索key self_search - 基于jQuery的本地搜索引擎，需要安装hexo-generator-search插件使用。 google_analytics - Google Analytics 跟踪ID baidu_analytics - 百度统计 跟踪ID fancybox - 是否启用Fancybox图片灯箱效果 show_category_count - 是否显示侧边栏分类数目 toc_number - 是否显示文章中目录列表自动编号 shareto - 是否使用分享按鈕，需要安装hexo-helper-qrcode插件使用 busuanzi - 是否使用不蒜子页面访问计数 wordcount - 是否使用hexo-wordcount文章字数统计 widgets_on_small_screens - 是否在移动设备屏幕底部显示侧边栏 canvas_nest - 是否使用canvas_nest.js动态背景 donate - 是否启用捐赠按钮 post_copyright - 是否在每篇文章后显示版权信息 love - 是否在任意点击处出现桃心 plantuml - 是否使用PlantUML生成UML图表 copycode - 是否为代码块启用一键复制功能 dark - 是否使用夜间模式切换功能 totop - 是否使用返回顶部小火箭图标 external_css - 是否加载外部CSS文件 menu - 自定义页面及菜单，依照已有格式填写。填写后请在source目录下建立相应名称的文件夹，并包含index.md文件，以正确显示页面。导航菜单中集成了FontAwesome图标字体，可以在这里选择新的图标，并按照相关说明使用。 widgets - 选择和排列希望使用的侧边栏小工具。 links - 友情链接，请依照格式填写。 timeline - 网站历史时间线，在页面front-matter中设置layout: timeline可显示。 Static files - 静态文件存储路径，方便设置CDN缓存。 Theme version - 主题版本，便于静态文件更新后刷新CDN缓存。 主题特性网站图标若要设置网站Favicon，可以将favicon.ico放在Hexo根目录的source文件夹下，建议的大小：32px*32px。 若要为网站添加苹果设备图标，请将命名为apple-touch-icon.png的图片放在同样的位置，建议的大小：114px*114px。 文章摘要首页默认显示文章摘要而非全文，可以在文章的front-matter中填写一项description:来设置你想显示的摘要，或者直接在文章内容中插入&#96;&#96;以隐藏后面的内容，若两者都未设置，则自动截取文章第一段作为摘要。 添加页面在source目录下建立相应名称的文件夹，然后在文件夹中建立index.md文件，并在index.md的front-matter中设置layout为layout: page。现已支持添加标签页面，将页面的layout设置为layout: tagcloud即可。若需要单栏页面，就将layout设置为 layout: single-column。 文章目录在文章的front-matter中添加toc: true即可让该篇文章显示目录。 文章评论文章和页面的评论功能可以通过在front-matter中设置comments: true或comments: false来进行开启或关闭（默认开启）。 语法高亮要启用代码高亮，请在Hexo目录的_config.yml中将highlight选项按照如下设置： 12345highlight: enable: true auto_detect: true line_number: true tab_replace: 数学公式要启用数学公式支持，请在Hexo目录的_config.yml中添加： 1mathjax: true 并在相应文章的front-matter中添加mathjax: true，例如： 12345title: Test Math date: 2016-04-05 14:16:00 categories: math mathjax: true --- 数学公式的默认定界符是$$...$$和\\$$...\\$$（对于块级公式），以及$...$和\\$$...\\$$（对于行内公式）。 但是，如果你的文章内容中经常出现美元符号“$”, 或者说你想将“$”用作美元符号而非行内公式的定界符，请在Hexo目录的_config.yml中添加： 1mathjax2: true 而不是mathjax: true。 相应地，在需要使用数学公式的文章的front-matter中也添加mathjax2: true。 支持语言目前支持简体中文（zh-CN），繁体中文（zh-TW），英语（en），法语（fr-FR），德语（de-DE），韩语（ko）和西班牙语（es-ES），欢迎翻译至其它语言。 问题解决 检查一下终端当前的目录是否为Hexo的根目录，并包含source/和themes/。 使用过程中遇到问题欢迎提交issue。 浏览器支持 IE &#x2F; Edge Firefox Chrome Safari Opera IE9+, Edge last 10 versions last 10 versions last 7 versions last 10 versions 贡献代码接受各种形式的贡献，包括不限于提交问题与需求，修复代码。等待您的Pull Request。 贡献者","path":"『转载』大道至简——Hexo-简洁主题推荐/","date":"07-10","excerpt":"","tags":[{"name":"转载","slug":"转载","permalink":"https://utgnim.github.io/sukebei/tags/%E8%BD%AC%E8%BD%BD/"}]},{"title":"浮生六记 - 卷一 闺房记乐 再见痴心","text":"是年冬，值其堂姊出阁，余又随母往。芸与余同齿而长余十月，自幼姊弟相呼，故仍呼之曰淑姊。 时但见满室鲜衣，芸独通体素淡，仅新其鞋而已。见其绣制精巧，询为己做，始知其慧心不仅在笔墨也。其形削肩长项，瘦不露骨，眉弯目秀，顾盼神飞，唯两齿微露，似非佳相。一种缠绵之态，令人之意也消。 索观诗稿，有仅一联，或三四句，多未成篇者。询其故，笑曰：“无师之作，愿得知己堪师者敲成之耳。”余戏其签曰“锦囊佳句”，不知夭寿之机此已伏矣。","path":"浮生六记-卷一-闺房记乐-再见痴心/","date":"07-10","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐 初见倾心","text":"余幼聘金沙于氏，八龄而夭；娶陈氏。 陈名芸，字淑珍，舅氏心余先生女也。生而颖慧，学语时，口授《琵琶行》，即能成诵。四龄失怙。母金氏，弟克昌，家徒壁立。芸既长，娴女红，三口仰其十指供给；克昌从师，脩脯无缺。 一日，于书簏中得《琵琶行》，挨字而认，始识字。刺绣之暇，渐通吟咏，有“秋侵人影瘦，霜染菊花肥”之句。 余年十三，随母归宁，两小无嫌，得见所作。虽叹其才思隽秀，窃恐其福泽不深，然心注不能释，告母曰：“若为儿择妇，非淑姊不娶。” 母亦爱其柔和，即脱金约指缔姻焉，此乾隆乙未七月十六日也。","path":"浮生六记-卷一-闺房记乐-初见倾心/","date":"07-08","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]},{"title":"浮生六记 - 卷一 闺房记乐","text":"余生乾隆癸未冬十一月二十有二日，正值太平盛世，且在衣冠之家，居苏州沧浪亭畔，天之厚我，可谓至矣。 东坡云：“事如春梦了无痕”。苟不记之笔墨，未免有辜彼苍之厚。因思《关雎》冠三百篇之首，故列夫妇于首卷，余以次递及焉。所愧少年失学，稍识之无，不过记其实情实事而已，若必考订其文法，是责明于垢鉴矣。","path":"浮生六记-卷一-闺房记乐/","date":"07-08","excerpt":"","tags":[{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"}]}],"categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%80%E6%9C%AF/"},{"name":"抄书","slug":"抄书","permalink":"https://utgnim.github.io/sukebei/tags/%E6%8A%84%E4%B9%A6/"},{"name":"练字","slug":"练字","permalink":"https://utgnim.github.io/sukebei/tags/%E7%BB%83%E5%AD%97/"},{"name":"歌词","slug":"歌词","permalink":"https://utgnim.github.io/sukebei/tags/%E6%AD%8C%E8%AF%8D/"},{"name":"中文马克思主义文库","slug":"中文马克思主义文库","permalink":"https://utgnim.github.io/sukebei/tags/%E4%B8%AD%E6%96%87%E9%A9%AC%E5%85%8B%E6%80%9D%E4%B8%BB%E4%B9%89%E6%96%87%E5%BA%93/"},{"name":"转载","slug":"转载","permalink":"https://utgnim.github.io/sukebei/tags/%E8%BD%AC%E8%BD%BD/"}]}