{
    "version": "https://jsonfeed.org/version/1",
    "title": "It's a blog • All posts by \"中文马克思主义文库\" tag",
    "description": "",
    "home_page_url": "https://utgnim.github.io/sukebei",
    "items": [
        {
            "id": "https://utgnim.github.io/sukebei/%E8%AF%84%E6%99%AE%E9%B2%81%E5%A3%AB%E6%9C%80%E8%BF%91%E7%9A%84%E4%B9%A6%E6%8A%A5%E6%A3%80%E6%9F%A5%E4%BB%A4/",
            "url": "https://utgnim.github.io/sukebei/%E8%AF%84%E6%99%AE%E9%B2%81%E5%A3%AB%E6%9C%80%E8%BF%91%E7%9A%84%E4%B9%A6%E6%8A%A5%E6%A3%80%E6%9F%A5%E4%BB%A4/",
            "title": "评普鲁士最近的书报检查令",
            "date_published": "2025-09-16T13:27:51.000Z",
            "content_html": "<p><strong>马克思</strong><br><strong>（1842 年 2 月）</strong></p>\n<p>《评旁观者最近的书报检查令》是卡尔·马克思的第一篇政论性文章，他的政治活动就是从这时开始的，当时他是一个革命民主主义者。</p>\n<p>19 世纪 40 年代初，德国正处于资产阶级革命的前夜，争取自由和民主的运动非常高涨，所以本文所谈到的问题，即关于普鲁士的出版状况问题，在当时显得特别尖锐。普鲁士政府于 1841 年 12 月 24 日颁布的新书报检查令，在表面上表示不赞成对作家的写作活动加以限制，实际上不仅保存了反动的普鲁士的书报检查制度，而且更加强了这种制度。</p>\n<p>马克思这篇揭露新检查令的虚伪自由主义的文章，没有在德国发表。这篇文章是在 1842 年 1 月 15 日至 2 月 10 日间写成的，但直到 1843 年 2 月才在瑞士发表，载于《德国现代哲学和政论界轶文集》（《Anekdota zur neuesten deutschen Philosophie und Publicistik》）第 1 卷。阿·卢格出版的这一文集（两卷集），除卡尔·马克思的两篇文章之外，还收集了布·鲍威尔、路·费尔巴哈、费·科本以及阿·卢格等人的文章。</p>\n<p>1851 年，海·贝克尔开始在科伦出版卡尔·马克思文集（Gesammelte Aufsatze von Karl Marx, herausgegeben von Hermann Becker. I. Heft, Koln, 1851），马克思把《评普鲁士最近的书报检查令》这一篇文章作为该文集的第一篇。由于普鲁士政府的查禁，这一版本在第一版出版后即被禁止发行</p>\n<hr>\n<p>我们不是那种心情不满的人，不会在普鲁士新的书报检查法令公布之前就声明说：Tieo Danaos et dona ferentes ［即便丹纳士人带来礼物，我还是怕他们］〔1〕。相反，因为新的检查令允许对已经颁布的法律进行讨论，哪怕这种讨论和政府的观点不一致，所能，我们现在就从这一检查令本身谈起。<strong>书报检查</strong>就是<strong>官方的批评</strong>。书报检查的标准就是批评的标准，因此，就很难把这种标准同批评分割开来，因为它们是建立同一个基础上的。</p>\n<p>当然，对于检查令序言中所表述的一般倾向，每个人都只能表示赞同：</p>\n<p>“为了使新闻出版<strong>现在就</strong>能摆脱那些未经许可的、违背陛下旨意的限制，国王陛下曾于本月 10 日下诏王室内阁，明确反对使写作活动受到各种无理的约束。国王陛下承认公正的、合乎礼貌的公众言论是重要的而且必需的，并授权我们再度现成书报检查官切实遵守 1819 年 10 月 18 日书报检查法令第 2 条的规定。”</p>\n<p>当然！既然书报检查是必要的，那么公正的、自由的书报检查就更加必要了。</p>\n<p>可是，这里有一点马上就会使人们感到有点诧异，那就是上述法律的<strong>日期</strong>。该法律颁布的日期是 1819 年 10 月 18 日。怎么？难道这是一项由于时势所迫而废除了的法律吗？看来不是，因为现在不过是“<strong>再度</strong>”现成书报检查官必须遵守这一法律。由此可见，这一法律 1842 年以前一直存在，不过没有实施罢了。正因为如此，现在才又提起它，“为了”使新闻出版“<strong>现在就</strong>能摆脱那些未经许可的、违背陛下旨意的限制。</p>\n<p><strong>尽管有了法律法律</strong>，但是新闻出版物到目前为止仍然受到种种未经许可的限制，这就是从上述书报检查令的序言中得出的直接结论。</p>\n<p>上面的话是<strong>针对法律</strong>，还是<strong>针对书报检查官</strong>呢？</p>\n<p>我们未必有理由能肯定说是后一种情况。在 22 年当中，保护公民的最高利益即<strong>他们的精神</strong>的主管机关，一直在进行非法的活动，这一机关的权力简直比罗马的书报检查官还要大，因为它不仅管理个别公民的行为，而且甚至管理公众精神的行为。在组织完善的、以自己的行政机关自豪的普鲁士国家里，政府高级官员的这种不负责任的行为。在组织完善的以自己的行政机关自豪的普鲁士国家里，政府高级官员的这种不负责任的行为，这种一贯的不忠诚的行为，难道可能发生吗？还是国家总是盲目地挑选最无能的人去担任最艰巨的职务呢？最后，也许是普鲁士国家的臣民已根本不可能起来抗议这种违法的行为吧？难道普鲁士的所有作者都如此愚昧无知，连与自己生存有关的法律也不知道吗？还是他们的胆子太小，竟不敢要求实施这种法律呢？</p>\n<p>假如我们把过错推在<strong>书报检查官</strong>身上，那么这不仅会败坏他们本身的名誉，而且会败坏普鲁士国家和普鲁士作者的名誉。</p>\n<p>况且，如果书报检查官二十多年来一直进行无视法律的非法活动，那就会提供 argumentum ad hominem 〔令人信服的证据〕，说明新闻出版需要的是别的保证，而不是给如此不负责任的人物发出的这种一般性的指令。那就会证明书报检查制度骨子里隐藏着一种用任何法律者无法消除的根本缺陷。</p>\n<p>可是，如果说书报检查官很中用，<strong>不中用的是法律</strong>，那么，为什么还要再度求助于法律去反对正是它本身所造成的祸害呢？</p>\n<p>或者，也许为了造成一种改善的假象而不从本质上去改善事物，才需要把制度本身的<strong>客观缺点</strong>归咎于<strong>个人</strong>吧？<strong>虚伪自由主义</strong>的手法通常总是这样的：在被迫让步时，它就牺牲人这个工具，而保全事物本身，即制度。这进就会转移从表面看问题的公众的注意力。</p>\n<p>对事物本身的愤恨就会变成对某些人的愤恨。有些人以为人一变换，事物本身也就会起变化。人们的注意力就从书报检查制度转移到了个别书报检查官身上，而那一伙专看官方眼色行事的卑劣作者，便放心大胆地反对那些不受宠幸的人，对政府却称颂备至。</p>\n<p>在我们面前还有一个困难。</p>\n<p>某些报纸的记者认为，书报检查令就是新的书报检查法令。他们错了，不过他们的这种错误是情有可原的。1819 年 10 月 18 日的书报检查法令只应当暂时有效，即到 1823 年为止有效，如果不是现在的书报检查令告诉我们上述法令从来没有被实施过，那么直到今天它仍然是一项临时性的法律。</p>\n<p>1819 年的法令也是一项<strong>过渡性</strong>措施，不过，当时规定了一定的期限——五年，可以期望颁布永久性法律，而新的检查令却没有规定任何期限；其次，当时期望颁布的是关于<strong>新闻出版自由的法律</strong>，而<strong>现在</strong>期望颁布的则是关于<strong>书报检查的法律</strong>。</p>\n<p>另一些报纸的记者则认为，这个书报检查令是旧的书报检查法令的翻新。检查令本身将驳倒他们这种错误的看法。</p>\n<p>我们认为，书报检查令是可能要颁布的书报检查法的<strong>精神的预示</strong>。在这一点上，我们是严格遵循 1819 年书报检查法令的精神的，根据这一法令，邦的<strong>法律</strong>和<strong>命令</strong>对新闻出版具有同样的作用（参看上述法令第 16 条第 2 款）。</p>\n<p>现在我们再回过头来看看检查令。</p>\n<p>“根据这一法律〈即根据第 2 条规定〉书报检查不得阻挠人们对真理作严肃和谦逊的探讨，不得使作者受到无理的约束，不得妨碍书籍在书市上自由流通。”</p>\n<p>书报检查不得阻挠的对真理的探讨，在这里有了更具体的规定：这就是<strong>严肃</strong>和<strong>谦逊</strong>的探讨。这两个规定要求探讨注意的不是内容，而无宁说是内容以外的某种东西。这些规定一开始就使探讨脱离了真理，并硬要它把注意力转移到某个莫名其妙的第三者身上。可是，如果探讨老是去注意这个由法律赋予挑剔权的第三者，难道它不是会忽视真理吗？难道真理探讨者的首要义务不就是直奔真理，而不要东张西望吗？假如我必须记住用指定的形式来谈论事物，难道我不是会忘记谈论事物本身吗？</p>\n<p>真理像光一样，它很难谦逊；而且要它对谁谦逊呢？对它本身吗？Verum index sui et falsi ［真理是检验它自身和谬误的试金石］。<strong>那么是以谬误吗</strong>？</p>\n<p>如果谦逊是探讨的特征，那么，这与其说是害怕谬误的标志，不如说是害怕真理的标志。谦逊是使我寸步难行的绊脚石。<strong>它就是规定在探讨时要对得出结论感到恐惧</strong>，它是一种对付真理的预防剂。</p>\n<p>其次，真理是普遍的，它不属于我一个人，而为大家所有；真理占有我，而不是我占有真理。我只有构成我的精神个性的形式。“风格如其人。”可是实际情形怎样呢！法律允许我写作，但是不允许我用<strong>自己的</strong>风格去写，我只能用另一种风格去写！我有权利表露自己的精神面貌，但是首先必须使这种面貌具有一种<strong>指定的表情</strong>！哪一个正直的人不为这种无理的要求脸红，而宁愿把自己的脑袋藏到罗马式长袍里去呢？至少可以预料在那长袍下面有一个丘必特的脑袋。指定的表情只不过意味着“强颜欢笑”而已。</p>\n<p>你们赞美大自然令人赏心悦目的千姿百态和无穷无尽的丰富宝藏，你们并不要求玫瑰花散发出和紫罗兰一样的芳香，但你们为什么却要求世界上最丰富的东西——精神只能有<strong>一种</strong>存在形式呢？我是一个幽默的人，可是法律却命令我用严肃的笔调。我是一个豪放不羁的人，可是法律却指定我用谦逊的风格。一片灰色就是这种自由所许可的唯一色彩。每一滴露水在太阳的照耀下者闪现着无穷无尽的色彩。但是精神的太阳，无论它照耀着多少个体，无论它照耀什么事物，却只准产生一种色彩，就是<strong>官方的色彩</strong>！精神的最主要形式是<strong>欢乐、光明</strong>，但你们却要使<strong>阴暗</strong>成为精神的唯一合适的表现；精神只准穿着黑色的衣服，可是花丛中却没有一枝黑色的花朵。精神的实质始终就是<strong>真理本身</strong>，而你们要把什么东西变成精神的实质呢？<strong>谦逊</strong>。歌德说过，只有怯懦者才是谦逊的，你们想把精神变成这样的怯懦者吗？也许，这种谦逊应该是席勒所说的那种天才的谦逊？𨃢是这样的话，那你们就先要把自己的全体公民、特别是你们所有的书报检查官者变成天才。况且天才的谦逊当然不像文雅的语言那样，避免使用乡音和土语，相反，天才的谦逊恰恰在于用事物本身的乡音和表达事物本质的土语来说话。天才的谦逊是要忘掉谦逊和不谦逊，使事物本身突现出来。精神的谦逊总的说来就是理性，就是按照事物的本质特征去对待<strong>各种事物</strong>的那种普遍的思想自由。</p>\n<p>其次，根据特利斯屈兰·善第所下的定义：严肃是肉体为掩盖灵魂缺陷而做出的一种虚伪姿态。如果<strong>严肃</strong>不应当适合这个定义，如果严肃的意思应当是<strong>注重实际</strong>的态度，那么这整个规定就会失去意义。因为我把可笑的事物看成是可笑的，这就是对它采取严肃的态度；对不谦逊仍然采取谦逊的态度，这也就是精神最大的不谦逊。</p>\n<p>严肃和谦逊！这是多么不固定的、相对的概念啊！严肃在哪里结束，诙谐又从哪里开始呢？谦逊在哪里结束，不谦逊又从哪里开始呢？我们的命运不得不由书报检查官的脾气来决定。给书报检查官指定一种脾气和给作者指定一种风格一样，都是错误的。要是你们想在自己的美学批评中表现得彻底，你们就得禁止<strong>过分严肃</strong>和<strong>过分谦逊</strong>去去探讨真理，因为过分的严肃就是最大的滑稽，过分的谦逊就是最辛辣的讽刺。</p>\n<p>最后，这是以对<strong>真理</strong>本身的完全歪曲的和缺角的观点为出发点的。作者的一切活动对象都被归结为“真理”这个一般观念。可是，同一个对象在不同的个人身上会获得不同的反映，并使自已的各个不同方面变成同样多的不同的精神性质；如果我们撇开一切<strong>主观</strong>的东西即上述情况不谈，难道<strong>对象的性质</strong>不应当对探讨发生一些哪怕是最微小的影响吗？不仅探讨的结果应当是合乎真理的，而且得出结果的途径也应当是合乎真理的。对真理的探讨本身应当是真实的，真实的探讨就是扩展了的真理，这种真理的各个分散环节在结果中是相互结合的。难道探讨的方式不应当随着对象而改变吗？当对象欢笑的时候，探讨却应当摆出严肃的样子；当对象令人讨厌的时候，探讨却应当是谦逊的。这样一来，你们就既损害了主体的权利，也损害了客体的权利。你们抽象地理解真理，把精神变成了枯燥地<strong>记录</strong>真理的<strong>裁判官</strong>。<br>也许不必去为这些玄妙的玩意儿伤脑筋？对真理是否干脆就应该这样去理解，即<strong>凡是政府的命令都是真理</strong>，而探讨只不过是一种既多余又麻烦的、可是由于礼节关系又不能完全取消的第三者？看来情况差不多就是如此。因为探讨一开始就被认为是一种同真理对立的东西，因此，它就要在可疑的官方侍从——严肃和谦逊（当然俗人对牧师应该采取这种态度）的伴随下出现。政府的玏是国家的唯一理性；诚然，在一定的时势下，这种理智也必须向另一种理智及其空谈作某些让步，但是到那时，后一种理智就应当意识到：别人已向它让了步，而它西亚是无权的，因此，它应当表现得谦逊而又恭顺，严肃而又乏味的体裁却是独一无二的体裁，只要指出《莱茵省等级会议议论情况》就足以证明这一点。既然如此，为什么不干脆恢复那美好的旧式的德国公文体裁呢？请随意写吧，可是写出来的每一个字都必须同时是对自由的书报检查机关的阿谀奉承之词，而书报检查机关也就会让你们那既严肃又谦逊的言论顺利通过。可千万不要失去虔敬的意识啊！</p>\n",
            "tags": [
                "中文马克思主义文库"
            ]
        },
        {
            "id": "https://utgnim.github.io/sukebei/%E9%9D%92%E5%B9%B4%E5%9C%A8%E9%80%89%E6%8B%A9%E8%81%8C%E4%B8%9A%E6%97%B6%E7%9A%84%E8%80%83%E8%99%91/",
            "url": "https://utgnim.github.io/sukebei/%E9%9D%92%E5%B9%B4%E5%9C%A8%E9%80%89%E6%8B%A9%E8%81%8C%E4%B8%9A%E6%97%B6%E7%9A%84%E8%80%83%E8%99%91/",
            "title": "青年在选择职业时的考虑",
            "date_published": "2025-09-14T05:08:44.000Z",
            "content_html": "<p><strong>『卡·马克思的中学考试德语作文』</strong></p>\n<p>自然本身给动物规定了它应该遵守的活动范围，动物也就安分地在这个范围内活动，而不试图越出这个范围，甚至不考虑有其它满园存在。神也给人指定了共同的目标——使人类和他自己趋于高尚，但是，神要人自己去寻找可以达到这个目标的手段；神让人在社会上选择一个最适合于他、最能使他和社会变得高尚的地位。</p>\n<p>这种选择是人比其它创造物远为优越的地方，但同时也是可能毁灭人的一生、破坏他的一切计划并使他陷于不幸的行为。因此，认真地权衡这种选择，无疑是开始走上生活道路而又不愿在最重要的事情上听天由命的青年的首要责任。</p>\n<p>每个人眼前都有一个目标，这个目标至少在他本人看来是伟大的，而且如果最深刻的信念，即内心深处的声音，认为这个目标是伟大的，那它实际上也是伟大的，因为神决不会使世人完全没有引导者；神轻声地但坚定地作启示。</p>\n<p>但是，这声音很容易被淹没；我们认为是热情的东西可能倏忽而生，同样可能倏忽而逝。也许，我们的幻想蓦然迸发，我们的感情激动起来，我们的眼前浮想联翩，我们狂热地追求我们以为是神本身给我们指出的目标；但是，我们梦寐以求的东西很快就使我们厌恶，于是，我们便感到自己的整个存在遭到了毁灭。</p>\n<p>因此，我们应当认真考虑：我们对所选择的职业是不是真的怀有热情？发自我们内心的声音是不是同意选择这种职业？我们的热情是不是一种迷误？我们认为是神的召唤的东西是不是一种自我欺骗？不过，如果不对热情的来源本身加以探究，我们又怎么能认清这一切呢？</p>\n<p>伟大的东西是闪光的，闪光会激发虚荣心，虚荣心容易使人产生热情 或者一种我们觉得是热情的东西；但是，被名利迷住了心窍的人，理性是无法加以约束的，于是他一头栽达那不可抗拒的欲念召唤他去的地方；，他的职业已经不再是由他自己选择，而是由偶然机会和假象去决定了。</p>\n<p>我们的使命决不是求得一个最足以炫耀的职业，因为它不是那种可能由我们长期从事，但始终不会使我们感到厌倦、始终不会使我们劲头低落、始终不会使我们的热情冷却的职业，相反，我们很快就会觉得，我们的愿望没有得到满足，我们的理想没有实现，我们就将怨天尤人。</p>\n<p>但是，不仅虚荣心能够引起对某种职业的突然的热情，而且我们也许会用自己的幻想把这种职业美化，把它美化成生活所能提供的至高无上的东西。我们没有仔细分析它，没有衡量它的全部分量，即它加在我们肩上的重大责任；我们只是从远处观察它，而从远处观察是靠不住的。</p>\n<p>在这里，我们自己的理性不能给我们充当顾问，因为当它被感情欺骗，受幻想蒙蔽时，它既不依靠经验，也不依靠更深入的观察。然而，我们的目光应该投向谁呢？当我们丧失理性的时候，谁来支持我们呢？</p>\n<p>是我们的父母，他们走过了漫长的生活道路，饱尝了人世辛酸。——我们的心这样提醒我们。</p>\n<p>如果我们经过冷静的考察，认清了所选择的职业的全部分量，了解它的困难以后，仍然对它充满热情，仍然爱它，觉得自己适合于它，那时我们就可以选择它，那时我们既不会受热情的欺骗，也不会仓促从事。</p>\n<p>但是，我们并不问题能够选择我们自认为适合的职业；我们在社会上的关系，还在我们有能力决定它们以前就已经在某种程度上开始确立了。</p>\n<p>我们的体质常常威胁我们，可是任何人也不敢藐视它的权利。</p>\n<p>诚然，我们能够超越体质的限制，但这么一来，我们也就垮得更快；在这种情况下，我们就是冒险把大厦建筑在残破的废墟上，我们的一生也就变成一场精神原则和肉体原则之间的不幸的斗争。但是，一个不能克服自身相互斗争的因素的人，又怎能抗御生活的猛烈冲击，怎能安静地从事活动呢？然而只有从安静中才能产生出伟大壮丽的事业，安静是唯一能生长出成熟果实的土壤。</p>\n<p>尽管我们由于体质不适合我们的职业，不能持久地工作，而且很少能够愉快地工作，但是，为了克尽职守而牺牲自己幸福的思想激励着我们不顾体弱去努力工作。如果我们选择了力不胜任的职业，那么我们决不能把它做好，我们很快就会自愧无能，就会感到自己是无用的人，是不能完成自己使命的社会成员。由此产生的最自然的结果就是自卑。还有比这更痛苦的感情吗？还有比这更难于靠外界的各种赐予来补偿的感情吗？自卑是一条毒蛇，它无尽无休地搅扰、啃啮我们的胸膛，吮吸我们心中滋润生命的血液，流入厌世和绝望的毒液。</p>\n<p>如果我们错误地估计了自己的能力，以为能够胜任经过较为仔细的考虑而选定的职业，那么这种错误将使我们受到惩罚。即便不受到外界的指责，我们也会感到比外界指责更为可怕的痛苦。</p>\n<p>如果我们把这一切都考虑过了，如果我们的生活条件容许我们选择任何一种职业，那么我们就可以选择一种使我们获得最高尊严的职业，一种建立在我们深信其正确的思想上的职业，一种能给我们提供最广阔的场所来为人类工作，并使我们自己不断接近共同目标即臻于完美境界的职业，而对于这个共同目标来说，任何职业都只不过是一种手段。</p>\n<p>尊严是最能使人高尚、使他的活动和他的一切努力具有更加崇高品质的东西，是使他无可非议、受到众人钦佩并高出于众人之上的东西。</p>\n<p>但是，能给人以尊严的只有这样的职业，在从事这种职业时我们不是作为奴隶般的工具，而是在自己的领域内独立地进行创造；这种职业不需要有不体面的行动（哪怕只是表面上不体面的行动），甚至最优秀的人物也会怀着崇高的自豪感去从事它。最合乎这些要求的职业，并不总是最高的职业，但往往是最可取的职业。</p>\n<p>但是，正如有失尊严的职业会𩨧我们一样，那种建立在我们后来认为是错误的思想上的职业也一定会成为我们的沉重负担。</p>\n<p>这里，我们除了自我欺骗，别无解救办法，而让人自我欺骗的解救办法是多么令人失望啊！</p>\n<p>那些主要不是干预生活本身，而是从事抽象真理的研究的职业，对于还没有确立坚定的原则和牢固的、不可动摇信念的青年是最危险的，当然，如果这些职业在我们心里深深地扎下了根，如果我们能够为它们的主导思想而牺牲生命、竭尽全力，这些职业看来还是最高尚的。</p>\n<p>这些职业能够使具有合适才干的人幸福，但是也会使那些不经考虑、凭一时冲动而贸然从事的人毁灭。</p>\n<p>相反，重视作为我们职业的基础的思想，会使我们在社会上占有较高的地位，提高我们自己的尊严，使我们的行为不可动摇。</p>\n<p>一个选择了自己所珍视的职业的人，一想到他可能不称职时就会战战兢兢——这种人单是因为他在社会上所处的地位是高尚的，他也就会使自己的行为保持高尚。</p>\n<p>在选择职业是，我们应该遵守的主要指针是人类的幸福和我们自身的完美。不应认为，这两种利益会彼此敌对、互相冲突，一种利益必定消灭另一种利益；相反，人的本性是这样的：人只有为同时代人的完美、为他们的幸福而工作，自己才能达到完美。</p>\n<p>如果一个人只为自己劳动，他也话能够成为著名的学者、伟大的哲人、卓越的诗人，然而他永远不能成为完美的、真正伟大的人物。</p>\n<p>历史把那些为共同目标工作因而自己高尚的人称为最伟大的人物；经验赞美那些为大多数人带来幸福的人是最幸福的人；宗教本身也教诲我们，人人敬仰的典范，就曾为人类而牺牲自己——有谁敢否定这类教诲呢？</p>\n<p>如果我们选择了最能为人类而工作的职业，那么我们所享受的就不是可怜的、有限的、自私的乐趣，我们的幸福将属于千百万人，我们的事业将悄然无声地存在下去，但是它会永远发挥作用，而面对我们的骨灰，高尚的人们将洒下热泪。</p>\n<p align=\"right\">卡·马克思写于 1835 年 8 月</p>\n",
            "tags": [
                "中文马克思主义文库"
            ]
        }
    ]
}